[
    {
        "symbol": "MSI",
        "name": "Motorola Moto G LTE (2015)",
        "description": "Although almost similar to its 3G-only counterpart, the new Moto G LTE (2015) boasts a few pretty interesting hardware differences in its specs sheet. The most notable one is, naturally, the on-board LTE connectivity. The second noteworthy specs sheet difference is the bigger battery - the LTE-enabled Moto G (2015) comes with a 2,390mAh battery (as a refresher, the 3G-only version has a \"merely\" 2,070mAh one). The larger battery at the back has not resulted in an increased waistline, mind you - the phone is still 11mm thick, but it's slightly heavier (155gr vs 149gr). Unlike the 3G-only Moto G (2014), the LTE-compliant one comes in a dual-SIM version only; it's also only available with 16GB of native storage. In conclusion, the device comes with Android 5.0 Lollipop out of the box.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Feb  2, 2015",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/51529-large/Motorola-Moto-G-LTE-2015.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola Moto E (2015)",
        "description": "The new Moto E has both LTE, and non-LTE variants. The handset is powered by a quad-core 1.2 GHz Qualcomm processor (a Snapdragon 410 on the LTE version, and a Snapdragon 200 on the 3G-only version), and comes with a 4.5-inch, 540 x 960 pixels display - thus being slightly larger than the 2014 model. Other features include a 5 MP rear camera with 720p video recording, VGA front-facing camera, 1 GB of RAM, 8 GB of expandable internal memory, and a 2390 mAh battery that's \"designed to last all day.\"",
        "phonearenaRating": "8",
        "userRating": "8",
        "announceDate": "Feb 25, 2015",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/51859-xlarge/Motorola-Moto-E-2015.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola DROID Turbo",
        "description": "Packing arguably one of the best hardware combinations available at the moment, the natural habitat of the Motorola DROID Turbo is somewhere near the very top of Mount Android, thanks to the 5.2-inch Quad HD display, the power-laden 2.7GHz Snapdragon 805, the 3GB of LPDDR3 RAM, the 21MP rear snapper capable of shooting 4K video clips, and the humongous, \"two-day\" 3,900mAh battery inside.",
        "phonearenaRating": "92",
        "userRating": "9.29.5",
        "announceDate": "Oct 28, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49888-large/Motorola-DROID-Turbo.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola Moto X (2014)",
        "description": "With the new Moto X we are getting a 5.2-inch AMOLED display running at 1080p, a customized Snapdragon 801 clocked at 2.5GHz, 2GB of RAM, a 13-megapixel camera, and a 2300mAh battery. The device measures 72.4 x 140.8mm (~2.85 x 5.54-inches) and the width ranges from 3.8 mm (0.15-inches) at the edge to 9.9mm (0.39-inches) at in the middle, and it will weigh 144 g (5.08oz). Sadly, the back logo is not a button, although it does look like one. But, the edge-to-edge design means that Motorola has been able to fit a slightly larger display in the same device width as the Samsung Galaxy S5.",
        "phonearenaRating": "88",
        "userRating": "8.89.4",
        "announceDate": "Sep  4, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49882-large/Motorola-Moto-X-2014.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola Moto E",
        "description": "The Moto E continues on the design legacy of the Moto X and Moto G, with a similar slightly chubby, curvy form with a dimple on the back. The handset comes with a 4.3-inch display with a resolution of 540 x 960 pixels (qHD). This might sound low on paper, but on this small screen, it works out to the very sharp pixel density of 256ppi. Best of all, the Moto E runs on the latest Android 4.4 KitKat. The little new Moto features a Snapdragon 200 system chip with 1.2GHz dual-core Cortex A7-based processor and an Adreno 302 GPU. There’s 1GB of RAM, and a scarce 4GB of internal storage (only 2.2GB available to end users!) that you can, luckily, expand via microSD cards. It’s also got a 5-megapixel camera (no flash in sight) capable of recording videos with 480 x 854-pixel resolution at 30 frames per second.",
        "phonearenaRating": "9",
        "userRating": "99.5",
        "announceDate": "May 13, 2014",
        "status": "Released",
        "releaseDate": "May 13, 2014",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/47057-xlarge/Motorola-Moto-E.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola Moto G",
        "description": "Looking at its specs sheet, we're surprised to see how much bang the Moto G can deliver for its money. First and foremost, our eyes are treated to a 4.5-inch \"edge-to-edge\" LCD display with a resolution of 720 by 1280 pixels. This gives us a figure of around 329ppi, which nothing short of great given the phone's cost. A layer of Gorilla Glass 3 protects the screen against light scratches. Then there's the processor ticking inside of the Moto G – a 1.2GHz, quad-core Snapdragon 400 silicon, which is no slouch by any means. 1GB of RAM is available on the device.",
        "phonearenaRating": "9",
        "userRating": "99",
        "announceDate": "Nov 13, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/43971-xlarge/Motorola-Moto-G.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola Moto X",
        "description": "The revolutionary Moto X lets you customize every nook and cranny of the outer appearance, down to your own boot animation, and headphones to match your back cover color. Every aspect of the phone was rehashed in line with the function it performs, rather than chasing the specs-o-meter. Moto went with OLED, as it makes possible the Active Display notification function, but it is a standard RGB matrix OLED, so you still get plenty of true pixel density, \"without wasting power on pixels most people can't see\". \n\nThe X8 processor might have \"just\" two CPU cores, but it is rethought from the ground up to make the always-on environmental awareness of the phone possible with power-sipping extra processing cores. The 10 MP camera might not be in line with the 13 MP on current flagships, but is the first to utilize the Clear Pixel technology that lets it soak much more light, and so on.",
        "phonearenaRating": "85",
        "userRating": "8.59.5",
        "announceDate": "Aug  1, 2013",
        "status": "Released",
        "releaseDate": "Aug 23, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42274-xlarge/Motorola-Moto-X.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola DROID MAXX",
        "description": "Motorola DROID MAXX has a 3500 mAh battery, which is 200 mAh more than its predecessor, and the kind of capacity only phablets get equipped with nowadays, and cited for up to 48 hours of battery life. That capacity is keeping the lights on a very interesting set of specs - 5\" HD OLED display (not PenTile), 1.7 GHz homemade processor, 2 GB of RAM and 32 GB of internal memory. Exact dimensions go as follows: 137.5x71.20x8.5 mm, so pretty thin despite the giant battery, and fairly light for a 5-incher at 160 grams, or 5.6 ounces.\n\nThe \"Motorola X8 Mobile Computing System\" SoC sports 1.7 GHz dual-core application processor, 400 MHz quad-core GPU, natural language processor, and a contextual computing processor, for an octa-core concoction, claims Moto.\n\nThe 10 MP camera on the back sports the new ClearPixel technology, which applies different RGBC color filter than the traditional Bayer RGBG one, bringing in more photons at low-light scenarios thus dealing better with blur and noise, at least on theory.",
        "phonearenaRating": "85",
        "userRating": "8.59.8",
        "announceDate": "Jul 23, 2013",
        "status": "Released",
        "releaseDate": "Aug 20, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42071-xlarge/Motorola-DROID-MAXX.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola ATRIX HD",
        "description": "Motorola ATRIX HD has a DROID RAZR style body with the now familiar Kevlar back. The 4.5 inch HD screen offers ColorBoost for vibrant colors and sharper images. It has 720 x 1280 pixels resolution and comes with Gorilla Glass. The nanocoated insides help prevent the Motorola ATRIX HD from a death by water. There is a dual-core 1.5GHz processor under the hood, 1 GB of RAM and 8GB of internal storage on board. An 8MP camera is on back, not the 13MP shooter once rumored, and there is a 1.3MP front-facing shooter. Android 4.0 is installed out of the box and it would appear that there are no physical Android navigation buttons. The battery is 1780 mAh. ATRIX HD is a quad-band GSM and quad-band HSPA global phone with support for AT&T's 4G LTE network. For those who keep track, the device is Motorola's model number MB886.",
        "phonearenaRating": "8",
        "userRating": "88.9",
        "announceDate": "Jul 10, 2012",
        "status": "Released",
        "releaseDate": "Jul 15, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37151-xlarge/Motorola-ATRIX-HD.jpg"
    },
    {
        "symbol": "MSI",
        "name": "Motorola DROID RAZR MAXX",
        "description": "Motorola DROID RAZR MAXX is a slightly thicker twin of the DROID RAZR, coming with a larger battery to boost its battery life. All other specs remain the same.",
        "phonearenaRating": "85",
        "userRating": "8.58.7",
        "announceDate": "Jan  9, 2012",
        "status": "Released",
        "releaseDate": "Jan 26, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/34431-xlarge/Motorola-DROID-RAZR-MAXX.jpg"
    }
]