[
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z4",
        "description": "The Sony Xperia Z4 features a 5.2-inch screen with a resolution of 1080 x 1920. It is powered by a 64-bit octa-core Snapdragon 810. 3GB of RAM is inside along with 32GB of native storage. Those requiring more memory can take advantage of the 128GB capacity microSD slot on board. A 20.7MP camera is on back with a wide angle 5.1MP snapper on front for selfies and video chats. A 2930mAh battery will keep the lights on, and Android 5.0 is pre-installed. The Sony Xperia Z4 will be available in White, Black, Copper and Aqua Green. The handset is IP6 certified for dust and IP5 and IP8 certified for water.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Apr 20, 2015",
        "status": "Announced",
        "releaseDate": "unknown",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/52739-xlarge/Sony-Xperia-Z4.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z3 Compact",
        "description": "The Sony Xperia Z3 Compact offers a 4.6-inch screen, with resolution of 720 x 1280. A quad-core 2.5GHz Snapdragon 801 CPU is under the hood, along with the Adreno 330 GPU. 2GB of RAM is inside, and a 20.7MP snapper adorn the rear of the phone. The front-facing camera weighs in at 2.2MP.",
        "phonearenaRating": "9",
        "userRating": "99.7",
        "announceDate": "Sep  3, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/48799-xlarge/Sony-Xperia-Z3-Compact.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z2a",
        "description": "The Sony Xperia Z2a is a smaller version of the Xperia Z2 flagship with plastic rear design, but still water and dust resistant. The phone comes with a 5-inch 1080 x 1920 IPS display, Snapdragon 801 SOC, 3GB RAM and 20.7 megapixels rear camera. The Xperia Z2a is powered by 3000mAh battery and runs Android KitKat. Its availability is expected to be limited to Asian markets only.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Jun 20, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/47625-large/Sony-Xperia-Z2a.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z3",
        "description": "The Xperia Z3 is Sony's thinnest Android flagship to date, with a profile that measures in at just 7.3 millimeters. Despite the slender build, however, the Z3 still packs some amazing hardware, including a quad-core Snapdragon 801 processor, 3GB of RAM, and a great, 20.7-megapixel camera.",
        "phonearenaRating": "85",
        "userRating": "8.59.3",
        "announceDate": "Sep  3, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/48792-xlarge/Sony-Xperia-Z3.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z2",
        "description": "The water and dust-resistant Xperia Z2 comes only six months after the previous Xperia Z1 flagship was released. Although it's quick update, the Xperia Z2 features a larger, 5.2-inch IPS display that boasts a new imaging technology, called Live Color LED. Of course, the screen is not the only improvement over its predecessor. Although it's even thinner and lighter, the Xperia Z2 runs on the brand new 2.3 GHz quad-core Snapdragon 801 chipset, paired with a fantastic 3 GB of RAM. The 20.7MP camera on its back is capable of 4K recording, slow-motion video, and adding real-time effects. Stereo speakers are now available, as well as noise cancellation and many more software and hardware extras. The Xperia Z2 is powered by a 3200mAh battery, which considerably improves talk time. It runs the latest Android version, 4.4 KitKat. All things considered, the Z2 is an improvement in every way.",
        "phonearenaRating": "92",
        "userRating": "9.29.1",
        "announceDate": "Feb 24, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/45592-xlarge/Sony-Xperia-Z2.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z1 Compact",
        "description": "All the great things we were hearing about the mini version of the Xperia Z1 heading for the international markets, turned out true. Dubbed xperia Z1 Compact, it is much, much smaller than the Z1, as it carries a 4.3\" 720p display, but keeps the same outstanding set of specs, most importantly the same 20 MP camera module with Sony's G Lens set.",
        "phonearenaRating": "9",
        "userRating": "99.1",
        "announceDate": "Jan  6, 2014",
        "status": "Released",
        "releaseDate": "Jan 24, 2014",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/44682-xlarge/Sony-Xperia-Z1-Compact.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z1",
        "description": "The Xperia Z1 is Sony’s Android flagship for the second half of 2013. The Xperia Z1 features a 20-megapixel camera with a large sensor and Sony’s G Lens, a 5-inch 1080p display, and all of that is wrapped in a water-resistant body. Under the hood, the Z1 runs on a Snapdragon 800 chip with 2GB of RAM.",
        "phonearenaRating": "92",
        "userRating": "9.29.4",
        "announceDate": "Sep  4, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42817-xlarge/Sony-Xperia-Z1.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z Ultra",
        "description": "The Japanese have not only made the thinnest 6.5mm watertight phone with the largest 6.44\" screen and fastest 2.2 GHz quad-core Snapdragon 800 processor with the Xperia Z Ultra at launch, but it also wanted to diversify its phablet functionalities beyond what is possible with Samsung's Note family, for instance. As such, they have employed a technology that allows you to write on the screen with any regular pen or pencil whose tip is more than 1mm in diameter, besides gracing it with stylus input functionality.",
        "phonearenaRating": "87",
        "userRating": "8.78.8",
        "announceDate": "Jun 25, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/41611-xlarge/Sony-Xperia-Z-Ultra.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia ZL",
        "description": "If you thought Xperia Z is amazing, but could make do without the waterproof part of it, Sony's got you covered, as it introduced the Xperia ZL sibling, with an even more compact design. With its 5.18\" x 2.74\" x 0.38\", it is shorter than the Z, and a soft-touch curved back nestles it comfortably in your palm grip.\nThe microSIM and microSD slots are situated under a large flap at the back bottom, and the phone is graced with a dedicated shutter key, unlike the glassy, watertight Z.\nSpecswise it is identical - a 5\" Full HD screen with Mobile BRAVIA Engine 2, and the typical for the tech weak viewing angles, a quad-core Snapdragon S4 Pro, and a 13 MP rear cam with HDR video capabilities. The funky part here is not only the circular power/lock key on the right, but also the front-facing camera, which is situated in the lower right corner of the phone, where you are used to find one of the Android navigational keys, which here are on-screen.\nBesides the shape and size, there is a slight difference in battery capacity between the two - the ZL has a sealed 2,370 mAh unit, which is a tad bigger than the one in the Z. The long-rumored IR blaster is indeed here, with the accompanying app that allows you to use the phone as a remote control for a wide variety of TVs, home stereos and other assorted electronics around the house.",
        "phonearenaRating": "8",
        "userRating": "89.3",
        "announceDate": "Jan  7, 2013",
        "status": "Released",
        "releaseDate": "Mar  7, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39567-large/Sony-Xperia-ZL.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia Z",
        "description": "The specs on the Xperia Z are what we expected from the rumors. It will be a 5\" 1080p display, a 1.5GHz quad-core Snapdragon processor, 2GB of RAM, LTE, a 2330mAh battery, and the highly anticipated new 13MP Exmor RS camera sensor. As we saw in leaked images, the Exmor RS camera sensor will allow for HDR video recording, and a newly announced feature is that it will also offer a 10fps burst mode at 9MP. The phone also has NFC and a microSD card for those of you looking for that. \nAn interesting addition to the Xperia Z is that the phone will be water resistant to a depth of one meter. To achieve this, the Xperia Z has glass panels on the front and back, as well as plastic strips on the sides that cover the ports. And, they cover all of the ports from microSD card slot, to headphone jack, to microUSB. \nThe phone will be running Android 4.1 Jelly Bean, which is part of the reason why the March release date is so disappointing, because that will be coming up on Google I/O and the expected announcement of Android 5.0, although Sony has promised an upgrade to 4.2 \"soon after launch\".",
        "phonearenaRating": "85",
        "userRating": "8.59.2",
        "announceDate": "Jan  7, 2013",
        "status": "Released",
        "releaseDate": "Feb  9, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39559-xlarge/Sony-Xperia-Z.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia TL",
        "description": "This is the LTE capable version of the Sony Xperia T whic is the company's newest flagship the Android ICS-powered device. Specs-wise, the Xperia T is equipped with a large 4.6” HD BRAVIA display, which will obviously take advantage of the Mobile BRAVIA engine that enhances media for your viewing pleasure. This, however, isn't where the interesting features of this display end. Sony has also employed its WhiteMagic technology here in the Xperia T. What it does is allowing you to set the brightness of the display really high, but the extra white pixel comes at the expense of natural color representation, at least in the Xperia P. NFC is thrown into the ring here, too, for sharing media, files and mobile payments.",
        "phonearenaRating": "8",
        "userRating": "89.3",
        "announceDate": "Oct  1, 2012",
        "status": "Released",
        "releaseDate": "Nov  2, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/38390-xlarge/Sony-Xperia-TL.jpg"
    },
    {
        "symbol": "SNE",
        "name": "Sony Xperia T",
        "description": "Sony Xperia T is the company's newest flagship the Android ICS-powered device. Specs-wise, the Xperia T is equipped with a large 4.6” HD BRAVIA display, which will obviously take advantage of the Mobile BRAVIA engine that enhances media for your viewing pleasure. This, however, isn't where the interesting features of this display end. Sony has also employed its WhiteMagic technology here in the Xperia T. What it does is allowing you to set the brightness of the display really high, but the extra white pixel comes at the expense of natural color representation, at least in the Xperia P. The CPU residing inside the Sony Xperia T is the trusty dual-core Snapdragon S4 with Adreno 225 graphics, so you are unlikely to feel underpowered with it. NFC is thrown into the ring here, too, for sharing media, files and mobile payments. The handset carries the new 13MP camera with \"stacked\" Exmor RS sensor, that is especially optimized for low-light photography and high dynamic range video, and goes from sleep-to-snap in an instant.",
        "phonearenaRating": "8",
        "userRating": "87.7",
        "announceDate": "Aug 29, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37750-xlarge/Sony-Xperia-T.jpg"
    }
]