[
    {
        "name": "BlackBerry Porsche Design P'9983",
        "description": "The Porsche Design P'9983 is the first 'Berry handset powered by BlackBerry 10.3. The phone offers a 3.1 inch SuperAMOLED screen with resolution of 720 x 720. Under the hood is a dual-core 1.5GHz Snapdragon S4 MSM8960 processor. 2GB of RAM is on board with 64GB of native storage and a 128GB capacity microSD slot. Back and front facing cameras weigh in at 8MP and 2MP, respectively. Powering the device is a 2100mAh battery. The phone comes with Bluetooth and NFC connectivity.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Oct 17, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49738-large/BlackBerry-Porsche-Design-P9983.jpg"
    },
    {
        "name": "BlackBerry PlayBook 3G+",
        "description": "This device appears to be a 3G enabled version of the QNX based BlackBerry PlayBook tablet, simply dubbed as the 3G+ BlackBerry PlayBook. Rather than calling it a 4G tablet outright, the attached “3G+” name is on there because the leaked slides mentions HSPA+ connectivity as its biggest differentiator with the previous model, as opposed to being a 4G LTE equipped model.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Jan 27, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/34553-xlarge/BlackBerry-PlayBook-3G.jpg"
    },
    {
        "name": "BlackBerry 9720",
        "description": "The BlackBerry 9720 is a brand new device, but it runs on the dated BlackBerry 7 operating system. In exchange for that shortcoming, it comes at an affordable price and features BlackBerry’s signature full QWERTY keyboard. Other specs include a 2.8-inch 320 x 480 pixel display, 800MHz processor with 512MB RAM, and a 1,450mAh battery with the pretty average 7 hours of talk time.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Aug 14, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42456-large/BlackBerry-9720.jpg"
    },
    {
        "name": "BlackBerry Passport",
        "description": "The Passport comes with a 4.5-inch square touch display with a 1440 x 1440 resolution and 453 PPI pixel density. Thanks to the integration of a touch-sensitive panel inside the hardware QWERTY keyboard below the display, your fingers almost never get in the way of reading or otherwise interacting with on-screen content. The Passport's hardware brawn is supplied by a 2.2GHz Snapdragon 801 quad-core processor and a spacey 3GB of RAM along with 32GB of expandable internal storage. Running BB OS 10.3, the productive smartphone is powered by a huge 3540 mAh battery, which BlackBerry said lasts 30 hours. Although the device ships with a 13MP camera with optical image stabilization, and a powerful processor, 4K video recording isn't being advertised anywhere, but it is said that the feature will come in an update.",
        "phonearenaRating": "75",
        "userRating": "7.58.6",
        "announceDate": "Jul 29, 2014",
        "status": "Released",
        "releaseDate": "Sep 24, 2014",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49345-xlarge/BlackBerry-Passport.jpg"
    },
    {
        "name": "BlackBerry Classic",
        "description": "The BlackBerry Classic is equipped with a 3.5 inch glass with resolution of 720 x 720. This works out to a pixel density of 291 ppi. A dual-core 1.5GHz Snapdragon MSM8960 processor is under the hood with 2GB of RAM. 16GB of native storage is on board, and a 128GB microSD slot is included for those seeking additional memory. Back and front-facing cameras weigh in at 8MP and 2MP respectively. A 2515 mAh battery powers the device.",
        "phonearenaRating": "65",
        "userRating": "6.56.7",
        "announceDate": "Feb 25, 2014",
        "status": "Released",
        "releaseDate": "Dec 17, 2014",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/50726-large/BlackBerry-Classic.jpg"
    },
    {
        "name": "BlackBerry Q5",
        "description": "The BlackBerry Q5 is an affordable BlackBerry 10 QWERTY smartphone. It features a QWERTY keyboard, 3.1\" touchscreen and is offered in 4 colours - black, white, red, pink. Details regarding the hardware specs of the BlackBerry Q5 are scarce at the current moment.",
        "phonearenaRating": "7",
        "userRating": "78.1",
        "announceDate": "May 15, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/40895-large/BlackBerry-Q5.jpg"
    },
    {
        "name": "BlackBerry Curve 9320",
        "description": "BlackBerry Curve 9320 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
        "phonearenaRating": "679",
        "userRating": "6.7",
        "announceDate": "May  9, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/36223-xlarge/BlackBerry-Curve-9320.jpg"
    },
    {
        "name": "BlackBerry Bold 9930",
        "description": "BlackBerry Bold 9930 is a CDMA/GSM hybrid with a 2.8-inch capacitive touch screen and a 1.2 Ghz processor. The device also sports a 5MP camera, 768MB of RAM and a 8GB build-in memory. It is set to launch with BlackBerry OS 7 and NFC support.",
        "phonearenaRating": "8",
        "userRating": "86.6",
        "announceDate": "May  2, 2011",
        "status": "Released",
        "releaseDate": "Aug 15, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/28486-xlarge/BlackBerry-Bold-9930.jpg"
    },
    {
        "name": "BlackBerry R10",
        "description": "The BlackBerry R10 is a yet unannounced device that is expected to become the third member of the BlackBerry 10 family, coming after the BlackBerry Z10 and Q10. The known specs include a QWERTY keyboard, 3.1-inch display with 720 x 720 px resolution, 5MP rear camera, front camera, 2GB of RAM, 8GB internal storage and a 1800 mAh non-removable battery.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "May 10, 2013",
        "status": "Not officially announced",
        "releaseDate": "unknown",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/40860-large/BlackBerry-R10.jpg"
    },
    {
        "name": "BlackBerry Curve 3G T-Mobile",
        "description": "RIM BlackBerry Curve 3G is an addition to the popular BlackBerry Curve series of smartphones. This is the version which has 3G support compatible with T-Mobile USA. Specs wise the phone offers nothing spectacular, 2MP camera, Wi-Fi, GPS, microSD slot for memory and compatibility with the new BlackBerry 6 OS.",
        "phonearenaRating": "75",
        "userRating": "7.5",
        "announceDate": "Aug  9, 2010",
        "status": "Released",
        "releaseDate": "Sep  8, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/21920-large/BlackBerry-Curve-3G-T-Mobile.jpg"
    },
    {
        "name": "BlackBerry Porsche Design P'9981",
        "description": "Porsche Design P'9981 is a smartphone from BlackBerry. The phone with the futuristic QWERTY keyboard was formerly known as the BlackBerry Knight. The handset will be available from Porsche Design stores and there is speculation that the price tag will be a very Porsche-like $2,000.\nSo what are you getting for that stack of 20 C notes? The device offers solid construction, for one thing with a forged stainless steel frame, leather back, and a sculpted QWERTY keyboard. The model is equipped with a exclusive Porsche Design UI and a Wikitude World Browser augmented reality app. Each unit of the P'9981 gets a premium PIN that allows the user of the device to find another P'9981 user in a crowd.\nOther specs include a single-core 1.2GHz processor, HD video capture and 8GB of native storage that can be pumped up to 40GB using a microSD card. The phone is NFC enabled and has BlackBerry 7 OS on board. That means the phone has the second-generation WebKit browser and includes the fast and smooth liquid graphics..",
        "phonearenaRating": "21",
        "userRating": "2",
        "announceDate": "Oct 27, 2011",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/32114-large/BlackBerry-Porsche-Design-P9981.jpg"
    },
    {
        "name": "BlackBerry Bold 9780 T-Mobile",
        "description": "RIM BlackBerry Bold 9780 for T-Mobile offers many of the same specs seen on the 9700 such as the 2.44 inch screen with resolution of 480x360 pixels, and a 624MHz processor. The changes include an upgrade to a 5MP camera and a doubling of RAM to 512MB, the new BlackBerry 6 OS and the companion WebKit browser, both delivering major multimedia improvements to Bold owners ready to move up to the new model.",
        "phonearenaRating": "85",
        "userRating": "8.57.5",
        "announceDate": "Oct 27, 2010",
        "status": "Released",
        "releaseDate": "Nov 17, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/23149-large/BlackBerry-Bold-9780-T-Mobile.jpg"
    },
    {
        "name": "BlackBerry Curve 9350",
        "description": "RIM BlackBerry Curve 9350 is a CDMA smartphone running BlackBerry OS7 powered by an 800MHz processor. It features a 2.44\" display, 5MP camera, Wi-Fi, GPS and microSDHC card slot.",
        "phonearenaRating": "6",
        "userRating": "62",
        "announceDate": "Aug 23, 2011",
        "status": "Released",
        "releaseDate": "Oct  2, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30685-xlarge/BlackBerry-Curve-9350.jpg"
    },
    {
        "name": "BlackBerry Z3",
        "description": "The BlackBerry Z3 is an all-touch handset with a 5-inch 540x960 display, dual-core 1.2GHz CPU, 1.5GB RAM, 5MP rear camera and 1.1MP front camera, 8GB of storage and a generous 2500mAh battery. It runs BlackBerry OS 10.",
        "phonearenaRating": "93",
        "userRating": "9",
        "announceDate": "Feb 25, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/47079-large/BlackBerry-Z3.jpg"
    },
    {
        "name": "BlackBerry Z30",
        "description": "The BlackBerry Z30 includes a 5-inch 720p (295 ppi) AMOLED display, the largest of any BB phone, and also the now aging aged Snapdragon S4 Pro with the four CPUs running at 1.7GHz. Blackberry is yet to shed light on whether we're talking about a dual-core or quad-core, though the less potent version seems likely. In terms of memory, you'll find 2GB RAM, with just 16GB of internal storage, though you can expand that via a microSD card. BlackBerry claims that the battery on the Z30, at 2880mAh, coupled with software optimizations, offers 50% more battery life than its current competitors, though manufactures have a pretty shady track record when it comes to this particular bit of hardware, and its actual capabilities.\nTurning to the camera on the Z30, an increasingly relevant component of the entire package a smartphone offers lately, we're welcomed by a 8MP rear camera with Auto Focus, 5x digital zoom and a an LED flash. The large five element lens with an aperture of f/2.2 mean that the unit will capture a lot of light, resulting in great shots. The snapper, as is to be expected, is capable of 1080p video capture, and comes with what BB chose to call “Time Shift” – a feature that basically allows you to choose and adjust faces from several snaps, so say goodbye to ill-timed shots.\nIn terms of connectivity and extras, the Z30 is anything but lacking – you get GPS, 4G LTE connectivity and Wi-Fi, of course, but also Bluetooth 4.0 LE (low energy), NFC, and the rather nice perk that is a microHDMI port.",
        "phonearenaRating": "75",
        "userRating": "7.59.7",
        "announceDate": "Sep 18, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42902-xlarge/BlackBerry-Z30.jpg"
    },
    {
        "name": "BlackBerry 4G PlayBook",
        "description": "RIM BlackBerry 4G PlayBook is the LTE enabled version of the BlackBerry PlayBook which is introduced as the first \"professional tablet\" keeping with the BlackBerry's heavy usage in the business world. The specs are hot enough to interest both consumers and business users. The PlayBook features a 7 inch capacitive LCD display with resolution of 1024 x 600 pixels. Instead of the new BlackBerry 6 OS, a new tablet version of the BlackBerry software devised by the QNX is running the show. The tablet will have some power under the hood with a 1.5GHz dual-core processor and 1GB of RAM on board. There are two cameras. The front facing shooter is 3MP with a 5MP on back. The WebKit browser will allow for HTML-5 and Adobe Flash Player 10.1.",
        "phonearenaRating": "7",
        "userRating": "710",
        "announceDate": "Jan  6, 2011",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/26184-xlarge/BlackBerry-4G-PlayBook.jpg"
    },
    {
        "name": "BlackBerry Torch 9850",
        "description": "RIM BlackBerry Torch 9850 is an all-touch smartphone featuring the biggest screen on a BlackBerry to date -  a 3.7” WVGA (480 x 800) capacitive touchscreen. It it features 1.2GHz processor, 5-megapixel camera, 720p video recoding, 8GB internal memory, microSD card slot, digital compass, 1230 mAh battery, 3G mobile hotspot functionality, Wi-Fi, accelerometer, and all this powered by BlackBerry OS 7. It is CDMA phone with quad-band GSM and European UMTS (2100 MHz).",
        "phonearenaRating": "75",
        "userRating": "7.58",
        "announceDate": "Aug  3, 2011",
        "status": "Released",
        "releaseDate": "Aug 21, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30270-xlarge/BlackBerry-Torch-9850.jpg"
    },
    {
        "name": "BlackBerry Curve 9370",
        "description": "RIM BlackBerry Curve 9370 is a world phone with dual-mode CDMA and GSM connectivity. Features include 2.44 inch display with resolution of 480x360, GPS and Wi-Fi are both aboard the handsets, 5MP camera with flash and video capture. Of course, the BlackBerry Curve 9370 runs the new BlackBerry 7 OS which includes RIM's second generation WebKit browser that eats up JavaScript and renders pages 40% faster than the browser on BlackBerry 6 OS.",
        "phonearenaRating": "55",
        "userRating": "5.5",
        "announceDate": "Aug 23, 2011",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30678-xlarge/BlackBerry-Curve-9370.jpg"
    },
    {
        "name": "BlackBerry Curve 9310",
        "description": "BlackBerry Curve 9310 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
        "phonearenaRating": "5",
        "userRating": "5",
        "announceDate": "Jun 27, 2012",
        "status": "Released",
        "releaseDate": "Jul 12, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37146-xlarge/BlackBerry-Curve-9310.jpg"
    },
    {
        "name": "BlackBerry Style 9670",
        "description": "The RIM BlackBerry Style 9670 handset is no doubt a departure from the usual portrait QWERTY handsets we've been accustomed to seeing, but it still manages to retain some elements that made RIM's portfolio so successful. The BlackBerry 9670 features CDMA connectivity, full QWERTY keyboard, 5-megapixel camera, Wi-Fi, 360 x 400 internal display, track pad and microSD slot which is all wrapped in a metallic casing.",
        "phonearenaRating": "75",
        "userRating": "7.58.6",
        "announceDate": "Oct 18, 2010",
        "status": "Released",
        "releaseDate": "Oct 31, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/22869-large/BlackBerry-Style-9670.jpg"
    },
    {
        "name": "BlackBerry Z20",
        "description": "The BlackBerry Z20 aka RIO is said to sport a 5-inch 720p screen, 8-megapixel camera with flash, 2-megapixel front facing one and LTE connectivity. The processing is done via a Qualcomm Snapdragon S4 MSM8960 dual-core chip clocked at 1.5GHz and 2GB of RAM.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Dec 30, 2014",
        "status": "Not officially announced",
        "releaseDate": "unknown"
    },
    {
        "name": "BlackBerry PlayBook",
        "description": "RIM BlackBerry PlayBook is introduced as the first \"professional tablet\" keeping with the BlackBerry's heavy usage in the business world. The specs are hot enough to interest both consumers and business users. The PlayBook features a 7 inch capacitive LCD display with resolution of 1024 x 600 pixels. Instead of the new BlackBerry 6 OS, a new tablet version of the BlackBerry software devised by the recently acquired QNX is running the show. The tablet will have some power under the hood with a 1GHz dual-core processor and 1GB of RAM on board. There are two cameras. The front facing shooter is 3MP with a 5MP on back. The WebKit browser will allow for HTML-5 and Adobe Flash Player 10.1.",
        "phonearenaRating": "7",
        "userRating": "7",
        "announceDate": "Sep 27, 2010",
        "status": "Released",
        "releaseDate": "Apr 19, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/22899-xlarge/BlackBerry-PlayBook.jpg"
    },
    {
        "name": "BlackBerry Curve 3G 9330",
        "description": "RIM BlackBerry Curve 3G 9330 is the CDMA version of RIM BlackBerry Curve 3G 9300. It comes with a QVGA display, 2MP camera, GPS and microSDHC card slot.",
        "phonearenaRating": "75",
        "userRating": "7.56.1",
        "announceDate": "Sep 14, 2010",
        "status": "Released",
        "releaseDate": "Sep 16, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/22440-large/BlackBerry-Curve-3G-9330.jpg"
    },
    {
        "name": "BlackBerry Curve 3G",
        "description": "RIM BlackBerry Curve 3G is an addition to the popular BlackBerry Curve series of smartphones. As the name suggests the BlackBerry Curve 3G supports 3G (HSDPA) networks around the world. Other features include 2MP camera, Wi-Fi, GPS, microSD slot for memory and compatibility with the new BlackBerry 6 OS.",
        "phonearenaRating": "7210",
        "userRating": "7.2",
        "announceDate": "Aug  9, 2010",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/21918-large/BlackBerry-Curve-3G.jpg"
    },
    {
        "name": "BlackBerry Bold 9650",
        "description": "The BlackBerry Bold 9650  has features such as a 3.2-megapixel camera, GPRS/UMTS, 1xEVDO/3G, quad-band GSM connectivity, 2.4” TFT LCD display with a resolution of 480x360 & support for 65k colors, and Bluetooth.",
        "phonearenaRating": "85",
        "userRating": "8.57.9",
        "announceDate": "Apr 26, 2010",
        "status": "Released",
        "releaseDate": "May 16, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/20857-large/BlackBerry-Bold-9650.jpg"
    },
    {
        "name": "BlackBerry Bold 9780",
        "description": "RIM BlackBerry Bold 9780 offers many of the same specs seen on the 9700 such as the 2.44 inch screen with resolution of 480x360 pixels, and a 624MHz processor. The changes include an upgrade to a 5MP camera and a doubling of RAM to 512MB, the new BlackBerry 6 OS and the companion WebKit browser, both delivering major multimedia improvements to Bold owners ready to move up to the new model.",
        "phonearenaRating": "85",
        "userRating": "8.58.3",
        "announceDate": "Oct 27, 2010",
        "status": "Released",
        "releaseDate": "Nov 14, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/23146-large/BlackBerry-Bold-9780.jpg"
    },
    {
        "name": "BlackBerry Curve 9220",
        "description": "RIM BlackBerry Curve 9220 is a candybar phone with a 2.44 inch display with resolution of 320x240, Wi-Fi, 512MB of RAM, Bluetooth and runs the latest version of the OS. BlackBerry 7.1 OS includes RIM's second generation WebKit browser that eats up JavaScript and renders pages 40% faster than the browser on BlackBerry 6 OS.",
        "phonearenaRating": "71",
        "userRating": "7",
        "announceDate": "Apr 18, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/36228-xlarge/BlackBerry-Curve-9220.jpg"
    },
    {
        "name": "BlackBerry Torch 9800",
        "description": "RIM BlackBerry Torch 9800 is a phone for all those customers who wanted something of both worlds – a multi-touch screen and RIM's  renown QWERTY keyboard design. The device will feature a 3.2-inch touchscreen with a resolution of 360x480 pixels (not exactly groundbreaking stuff), 512MB RAM, 5MP camera, Wi-Fi 802.11 b/g/n and quad-band 3G. The design and hardware of the BlackBerry Torch seem great for the most part, but equally impressive should be the software that will be employed in the new smartphone. First before most we should mention the brand new web browser that will support tabs and pinch-to-zoom. RIM's acclaimed messaging/email prowess are of course present, along with much improved social networking and multimedia capabilities, which will all be part of the new BlackBerry 6 operating system that will be powering the Torch.",
        "phonearenaRating": "8",
        "userRating": "89.1",
        "announceDate": "Aug  3, 2010",
        "status": "Released",
        "releaseDate": "Aug 12, 2010",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/21867-large/BlackBerry-Torch-9800.jpg"
    },
    {
        "name": "BlackBerry Curve 9315",
        "description": "BlackBerry Curve 9315 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
        "phonearenaRating": "5",
        "userRating": "56",
        "announceDate": "Jan  3, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39521-xlarge/BlackBerry-Curve-9315.jpg"
    },
    {
        "name": "BlackBerry Leap",
        "description": "The BlackBerry Leap sports the fairly quaint Snapdragon S4 Plus system chip with 2GB of RAM and 16 gigs of internal storage. It's the battery life that the company touts as one of the hallmark features of the new phone, though, as it has a 2800 mAh battery pack. With all the sleek newly unveiled devices, though, the Leap strikes an impression of being quite thick with 9.5mm of thickness and a weight of 170g. There is both a rear and front-facing camera: the rear, main one, has an 8-megapixel sensor.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Mar  3, 2015",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/52104-large/BlackBerry-Leap.jpg"
    },
    {
        "name": "BlackBerry Curve 9380",
        "description": "BlackBerry Curve 9380 is the first ever Curve with a capacitive touch display. The handset features a 3.2\" display with 360x480 pixels, an 800MHz processor and a 5MP camera with flash and VGA video recording. Of course, onboard are BBM and all the usual BlackBerry software security features, that have made RIM's devices a favorite for enterprises and government agencies.",
        "phonearenaRating": "65",
        "userRating": "6.5",
        "announceDate": "Nov 15, 2011",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/33279-xlarge/BlackBerry-Curve-9380.jpg"
    },
    {
        "name": "BlackBerry Bold 9790",
        "description": "The BlackBerry Bold 9790 is running BlackBerry OS 7 and sports a 2.45-inch touchscreen display, 1GHz processor, 768MB of RAM, 5-megapixel camera,Wi-Fi, GPS, 8GB internal memory and NFC chip.",
        "phonearenaRating": "7",
        "userRating": "76.4",
        "announceDate": "Nov 15, 2011",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/33283-xlarge/BlackBerry-Bold-9790.jpg"
    },
    {
        "name": "BlackBerry Curve 9360",
        "description": "RIM BlackBerry Curve 9360 comes equipped with a 2.44\" 480 x 360 display, 5-megapixel camera, microSDHC card slot, GPS, Wi-Fi and Bluetooth 2.1. All this is powered by BlackBerry OS7 with an 800MHz processor running the show.",
        "phonearenaRating": "8",
        "userRating": "87.3",
        "announceDate": "Aug 23, 2011",
        "status": "Released",
        "releaseDate": "Sep 28, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30687-xlarge/BlackBerry-Curve-9360.jpg"
    },
    {
        "name": "BlackBerry Z10",
        "description": "The Z10 is a fully touchscreen BB10 device sporting modern specs, with cool patterned soft-touch material on the back. The screen is 4.2\" LCD with 1280 x 768 pixels, making for a pixel density of 356 pixels per inch. A 1.5 GHz dual-core processor and 2 GB of RAM are the power under the hood, and there are 16 GB of internal storage, as well as the all-important microSD card slot. \nYou will need all the RAM, because BB10 is a true multitasking system, like Android, so everything remains how you left it, or moves on under the hood, but is available at all times.",
        "phonearenaRating": "7",
        "userRating": "79.3",
        "announceDate": "Jan 30, 2013",
        "status": "Released",
        "releaseDate": "Jan 31, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39683-xlarge/BlackBerry-Z10.jpg"
    },
    {
        "name": "BlackBerry Q10",
        "description": "With its hardware QWERTY keyboard, the BlackBerry Q10 follows in the footsteps of many legacy smartphones made by RIM. The four rows of hardware keys are situated underneath a high-resolution, 720 by 720 pixel touchscreen measuring 3.1 inches in diagonal. The back of the BlackBerry Q10 is made out of a fancy, glass-like material that is claimed to be stronger, thinner, and lighter than the plastic used in many handsets today. The company's re-imagined BlackBerry 10 operating system runs on the device.",
        "phonearenaRating": "7",
        "userRating": "79.8",
        "announceDate": "Jan 30, 2013",
        "status": "Released",
        "releaseDate": "Apr 30, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/43940-xlarge/BlackBerry-Q10.jpg"
    },
    {
        "name": "BlackBerry Bold 9900",
        "description": "BlackBerry Bold 9900 comes with a 2.8-inch capacitive touch screen and a magnificent resolution for its size - 640x480. It is a quad-band GSM/GPRS/EDGE handset, and also supports a tri-band HSPA. This device also sports a 5MP camera, 768MB of RAM and a 8GB build-in memory. It is set to launch with BlackBerry OS 7 and NFC support.",
        "phonearenaRating": "7",
        "userRating": "78.6",
        "announceDate": "May  2, 2011",
        "status": "Released",
        "releaseDate": "Aug 11, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/28482-xlarge/BlackBerry-Bold-9900.jpg"
    },
    {
        "name": "BlackBerry Torch 9860",
        "description": "RIM BlackBerry Torch 9860 is an all-touch smartphone featuring the biggest screen on a BlackBerry to date - is a 3.7” WVGA (480 x 800) capacitive touchscreen. It features 1.2GHz processor, 5-megapixel camera, 720p video recoding, 8GB internal memory, microSD card slot, digital compass, 1230 mAh battery, 3G mobile hotspot functionality, Wi-Fi, accelerometer, and all this powered by BlackBerry OS 7. It is a quad-band GSM and tri-band UMTS world phone, with alternative variant featuring T-Mobile AWS 3G band.",
        "phonearenaRating": "75",
        "userRating": "7.59",
        "announceDate": "Aug  3, 2011",
        "status": "Released",
        "releaseDate": "Nov  6, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30265-large/BlackBerry-Torch-9860.jpg"
    },
    {
        "name": "BlackBerry Torch 9810",
        "description": "RIM BlackBerry Torch 9810 happens to have a clear cut design similarity with the original handset. However, looking past the surface and deeper into its hardware, there's something beating much faster under the hood that's going to supply the handset some much needed processing power. It is packing on a serious 1.2GHz processor with hardware acceleration to really make it tangle with the other big guns in the industry. Moreover, it sports the same size 3.2” touchscreen but now with improved VGA resolution, 8GB of internal storage, and 768MB RAM. Other features include GPS, 5-megapixel camera with flash and HD video, Bluetooth 2.1, 1270 mAh battery, magnetometer, and an accelerometer.",
        "phonearenaRating": "65",
        "userRating": "6.5",
        "announceDate": "Aug  3, 2011",
        "status": "Released",
        "releaseDate": "Aug 11, 2011",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/30293-large/BlackBerry-Torch-9810.jpg"
    }
]