[{
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-2-verizon",
    "name": "Apple iPad 2 Verizon",
    "description": "Apple's first CDMA tablet is a version of the iPad 2 for Verizon, and it shares all its specs, save for the 1.34 pounds (607 g) of weight. The iPad 2  improves on its predecessor in both desing and hardware, since the renowned tablet is now thinner even than the iPhone 4 at 0.34\" (8.8mm). It is powered by a 1GHz dual-core Apple A5 chipset, which provides 2x the CPU and 9x the GPU performance of its predecessor. All that while keeping the same 10 hours of battery life. Dressed entirely in black or white this time, the iPad 2 sports HDMI output via a separate cable, as well as rear and front-facing cameras - the first supports HD video recording, and the second FaceTime for video chat with other iDevices.",
    "phonearenaRating": "85",
    "userRating": "8.58.7",
    "announceDate": "Mar  2, 2011",
    "status": "Released",
    "releaseDate": "Mar 11, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27204-large/Apple-iPad-2-Verizon.jpg",
    "weight": "21.41 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-6-plus",
    "name": "Apple iPhone 6 Plus",
    "description": "The iPhone 6 Plus is Apple's largest smartphone ever, with a 5.5-inch display and a resolution of 1080 x 1920 pixels -- good for a pixel density of 401 ppi. The rest of the highlights of Apple's first phablet include a 64-bit dual-core A8 processor with an M8 co-processor, an 8-megapixel iSight camera with optical image stabilization and a two-tone LED flash, and, for the first time for an Apple device -- an NFC chip that facilitates mobile payments through the company's Apple Pay service.",
    "phonearenaRating": "9",
    "userRating": "99.1",
    "announceDate": "Sep  9, 2014",
    "status": "Released",
    "releaseDate": "Sep 19, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48965-xlarge/Apple-iPhone-6-Plus.jpg",
    "weight": "6.07 oz",
    "size": "5.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-3",
    "name": "Apple iPad 3",
    "description": "The Apple iPad 3, or simply iPad, as it is officially called, is Apple's latest foray in the contemporary tablet market - a market the company single-handedly started about two years ago. Although the third-generation iPad remains the same on the outside (not a bad thing), it does bring a lot of improvements on the inside. First of all, it has a new screen resolution of 2048x1536 pixels, delivering an amazing for a tablet pixel density of 264 ppi. Another major improvement has to do with the processor of the device, which is now the so-called A5X - still a dual-core processor, but with a new quad-core GPU for outstanding graphics performance. The camera has also been given a boost and is now much more capable in terms of both photo- and video-taking.",
    "phonearenaRating": "9",
    "userRating": "98",
    "announceDate": "Mar  7, 2012",
    "status": "Released",
    "releaseDate": "Mar 16, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35291-xlarge/Apple-iPad-3.jpg",
    "weight": "23.00 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone",
    "name": "Apple iPhone",
    "description": "Apple iPhone is unique phone with slim profile and no keys - it has 3.5 inches touch display that uses multi-touch technology for navigation. A sensor controls the orientation of the display, and iPhone OS controls the smartphone's functionality. It is a quad-band GSM/EDGE device with WiFi and Bluetooth, and features 16/8/4GB of memory. Among its features there are YouTube and Google Maps applications, excellent internet browser called Safari and iPOD music/video player with CoverFlow technology, showing large album covers.",
    "phonearenaRating": "88",
    "userRating": "8.88.1",
    "announceDate": "Jan  9, 2007",
    "status": "Released",
    "releaseDate": "Jun 29, 2007",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/9090-large/Apple-iPhone.jpg",
    "weight": "4.80 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-6",
    "name": "Apple iPhone 6",
    "description": "The iPhone 6 represents Apple's second largest departure in terms of design since the iPhone 4, and ushers in an era of rounded aesthetics. Equipped with a 4.7-inch display, the iPhone 6 is also much larger than its predecessor, the iPhone 5s, but Apple has managed to trim some extra fat in order to make the new iPhone even thinner, at 0.27 in (6.9 mm). \n\nThe innards of the iPhone 6, too, went through improvements. The home-grown dual-core A8 processor is the third consecutive Apple chip to be custom-designed, and offers performance improvements of up to 25% and 50% in the of CPU and GPU departments respectively. The 8-megapixel, 1/3” iSight camera also received several upgrades, mostly on the software side, and now offers faster, phase detection auto focus, plus support for super-smooth 720p clips at the industry-leading 240 frames per second.",
    "phonearenaRating": "9",
    "userRating": "99.2",
    "announceDate": "Sep  9, 2014",
    "status": "Released",
    "releaseDate": "Sep 19, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48955-xlarge/Apple-iPhone-6.jpg",
    "weight": "4.55 oz",
    "size": "4.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-air",
    "name": "Apple iPad Air",
    "description": "The iPad Air is Apple's fifth generation full-sized iPad tablet, and the name is definitelly fitting for this remarkable device. It is only 7.5 millimeters thin and weighs just 469 grams, making it the lightest slate of this size. Its screen is identical to the one we know from its predecessor - a 9.7-inch Retina Display with oleophobic coating and resolution of 1536 by 2048 pixels. Under the hood, Apple has chosen to install its A7 chip, which is the very same 64-bit SoC powering the iPhone 5s. As a result, the new iPad is two times faster than the previous model. With the 5MP iSight camera, one can take detailed photos and 1080p Full HD videos, while the FaceTime HD front-facing snapper is ideal for video chats and self portraits. Connecting to the internet is done either via Wi-Fi, or over a 4G LTE network, should you choose a cellular-enabled iPad Air model. Apple's iOS 7 operating system is loaded onto the tablet, with iPhoto, iMovie, GarageBand, Pages, Numbers, and Keynote apps included at no cost.",
    "phonearenaRating": "92",
    "userRating": "9.29.2",
    "announceDate": "Oct 22, 2013",
    "status": "Released",
    "releaseDate": "Nov  1, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/43426-large/Apple-iPad-Air.jpg",
    "weight": "16.86 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipod-touch-2nd-generation",
    "name": "Apple iPod touch 2nd generation",
    "description": "Apple iPod touch 2nd generation is a portable media player running Apple`s iOS 2.1. It has 3.5\"  capacitive display, Wi-Fi, accelerometer, music and video player.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep  9, 2008",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27967-large/Apple-iPod-touch-2nd-generation.jpg",
    "weight": "4.05 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-2",
    "name": "Apple iPad 2",
    "description": "The second generation of Apple's venerable tablet - iPad 2 - improves on its predecessor in both design and hardware. The iconic tablet is now thinner even than the iPhone 4 at 0.34\" (8.8mm), and weighs just 1.35 pounds (613 grams). The big changes on the inside is the 1 GHz dual-core Apple A5 chipset, which provides 2x the CPU and 9x the GPU performance of its predecessor. All that while keeping the same 10 hours of battery life. Dressed entirely in black or white this time, the iPad 2 also sports HDMI output via a separate cable, as well as rear and front-facing cams, plus a bunch of new cool accessories.",
    "phonearenaRating": "85",
    "userRating": "8.58.8",
    "announceDate": "Mar  2, 2011",
    "status": "Released",
    "releaseDate": "Mar 11, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27191-large/Apple-iPad-2.jpg",
    "weight": "21.62 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-4s",
    "name": "Apple iPhone 4s",
    "description": "The iPhone 4s is a gradual step over the iPhone 4 improving the internals, but keeping the look and feel. At the same time, though, it brings a reworked iOS 5 and introduces Siri, a personal voice assistant allowing you to vocally communicate with the iPhone. It comes with a 3.5\" screen with a resolution of 640 x 960 pixels, but on the inside there's a twice more powerful dual-core A5 processor. It also improves connectivity a notch, bringing 14.4Mbps HSPA download speeds. The back is where an 8-megapixel camera resides and it's capable of recording 1080p videos.",
    "phonearenaRating": "85",
    "userRating": "8.58.1",
    "announceDate": "Oct  4, 2011",
    "status": "Released",
    "releaseDate": "Oct 14, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/31840-large/Apple-iPhone-4s.jpg",
    "weight": "4.94 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-mini-2",
    "name": "Apple iPad mini 2",
    "description": "The iPad mini with Retina Display kicker? That amazing 7.9\" display carries the same resolution as the larger iPad. That's right, 2048x1536 pixels amounts to 326ppi pixel density, a record feat on a device that is basically all screen. Neither Nexus 7, nor the G Pad 8.3 can match this, but it's up to you if the premium design and the extra pixel density are worth the $399 starting price Apple is commanding for the iPad mini with Retina Display. Bear in mind that it is also incredibly thin and light, and all of that is achieved from an aluminum-crafted chassis that comes in the trendy Space Gray color now.",
    "phonearenaRating": "85",
    "userRating": "8.59.5",
    "announceDate": "Oct 22, 2013",
    "status": "Released",
    "releaseDate": "Nov 12, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/43425-xlarge/Apple-iPad-mini-2.jpg",
    "weight": "12.03 oz",
    "size": "7.9 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-5c",
    "name": "Apple iPhone 5c",
    "description": "The iPhone 5c replaces the iPhone 5 in the Apple stable, inheriting its internals, like the A6 processor, 4\" screen and 8 MP camera, but wraps them up in \"unapologetically plastic\" candy chassis that can be mixed and matched in many colors with the new slotted cases. It is Apple's first take at the upper mid-range concept, and runs the newest iOS 7 without a hitch.",
    "phonearenaRating": "9",
    "userRating": "99",
    "announceDate": "Sep 10, 2013",
    "status": "Released",
    "releaseDate": "Sep 20, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42880-xlarge/Apple-iPhone-5c.jpg",
    "weight": "4.66 oz",
    "size": "4.0 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-5",
    "name": "Apple iPhone 5",
    "description": "The Apple iPhone 5 is the first iPhone with a larger, 4-inch screen. At the same time, it has become thinner, with a more elongated body. The iPhone 5 is powered by a new A6 chip that’s twice as powerful as the chip on the preceding iPhone 4S. It’s also the first iPhone with 4G LTE, supporting not just American frequencies, but LTE networks across the globe.",
    "phonearenaRating": "9",
    "userRating": "98.5",
    "announceDate": "Sep 12, 2012",
    "status": "Released",
    "releaseDate": "Sep 21, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37986-xlarge/Apple-iPhone-5.jpg",
    "weight": "3.95 oz",
    "size": "4.0 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-3-verizon",
    "name": "Apple iPad 3 Verizon",
    "description": "The Apple iPad 3 for Verizon Wireless, or simply iPad, as it is officially called, is Apple's latest foray in the contemporary tablet market - a market the company single-handedly started about two years ago. Although the third-generation iPad remains the same on the outside (not a bad thing), it does bring a lot of improvements on the inside. First of all, it has a new screen resolution of 2048x1536 pixels, delivering an amazing for a tablet pixel density of 264 ppi. Another major improvement has to do with the processor of the device, which is now the so-called A5X - still a dual-core processor, but with a new quad-core GPU for outstanding graphics performance. The camera has also been given a boost and is now much more capable in terms of both photo- and video-taking. Finally, the new iPad 3 has been blessed with LTE connectivity. Additionally, all 4G iPads will also have global 3G capabilities, so you should be able to use 3G on most carriers around the world.",
    "phonearenaRating": "9",
    "userRating": "9",
    "announceDate": "Mar  7, 2012",
    "status": "Released",
    "releaseDate": "Mar 16, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35301-xlarge/Apple-iPad-3-Verizon.jpg",
    "weight": "23.35 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-mini",
    "name": "Apple iPad mini",
    "description": "The iPad mini is a thinner, lighter, cheaper variant of the iPad as we know it, with a smaller screen and form factor that makes it even more portable than its larger sibling. Thanks to its 4:3 aspect ratio, the iPad mini is actually superior to 7-inch tablets with a wide ratio. That is due to the more surface area available on the device's screen, which results in a richer web browsing experience.",
    "phonearenaRating": "85",
    "userRating": "8.5",
    "announceDate": "Oct 23, 2012",
    "status": "Released",
    "releaseDate": "Nov  2, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38591-xlarge/Apple-iPad-mini.jpg",
    "weight": "11.01 oz",
    "size": "7.9 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-4-verizon",
    "name": "Apple iPhone 4 Verizon",
    "description": "The first CDMA version of the Apple iPhone - the iPhone 4 is almost completely identical to AT&T's smartphone, with the only difference being the CDMA radio and ability to do Mobile Hotspot for up to 5 devices. The other features include a 5MP main camera lens with LED flash and 720p HD video recording, secondary mic for noise-cancellation, GPS, Gyroscope and what not.",
    "phonearenaRating": "9",
    "userRating": "97.9",
    "announceDate": "Jan 11, 2011",
    "status": "Released",
    "releaseDate": "Feb 10, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/26122-xlarge/Apple-iPhone-4-Verizon.jpg",
    "weight": "4.83 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-air-2",
    "name": "Apple iPad Air 2",
    "description": "The iPad Air 2 is technically Apple's sixth generation iPad, and the second to carry the 'Air' moniker. It's slightly thinner than the original Air, but differs little in appearance. The main changes are under the hood: the tablet runs on iOS 8 and is powered by Apple's A8X chip, and it gets a higher-resolution 8-megapixel camera.",
    "phonearenaRating": "9",
    "userRating": "910",
    "announceDate": "Oct 16, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49747-xlarge/Apple-iPad-Air-2.jpg",
    "weight": "15.41 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-3gs",
    "name": "Apple iPhone 3GS",
    "description": "Apple iPhone 3GS adds support for HSDPA 7.2 Mbps fast data and a digital compass. The new model from Cupertino's factory also has an improved battery life and working speed - loading is much more faster. The camera is upgraded to a 3-megapixel sensor with autofocus and tap to focus option and is capable of video recording with a VGA resolution (640x480 pixels). In the other aspects, Apple iPhone 3GS is pretty much the same as the previous version and has a 3.5\" multi-touch display with resolution of 480x320 pixels, Wi-Fi, GPS and it has the same size.",
    "phonearenaRating": "85",
    "userRating": "8.58",
    "announceDate": "Jun  8, 2009",
    "status": "Released",
    "releaseDate": "Jun 19, 2009",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/16112-large/Apple-iPhone-3GS.jpg",
    "weight": "4.76 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipod-touch-5th-generation",
    "name": "Apple iPod touch 5th generation",
    "description": "The 2012 iPod touch is probably the biggest redefinition the series has seen since its launch. For the first time, the iPod touch arrives with a bigger, 4-inch display, a 5-megapixel iSight camera shooting 1080p video, and a selection of vibrant colors. The iPod touch has a brilliant new design putting it in a category where it’s thinner and lighter than the iPhone, and with a unique lace it almost looks like this device is now not just a music player, but also a camera replacement.",
    "phonearenaRating": "911",
    "userRating": "9",
    "announceDate": "Sep 12, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38586-xlarge/Apple-iPod-touch-5th-generation.jpg",
    "weight": "3.10 oz",
    "size": "4.0 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipod-touch-4th-generation",
    "name": "Apple iPod touch 4th generation",
    "description": "Apple iPod touch 4th generation is a portable media player running Apple`s iOS 4.3. It has 3.5\" Retina display, Apple A4 processor, 0.7MP rear camera, 0.3MP front camera, Wi-Fi and Bluetooth.",
    "phonearenaRating": "8115",
    "userRating": "8.1",
    "announceDate": "Sep  1, 2010",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27955-large/Apple-iPod-touch-4th-generation.jpg",
    "weight": "3.56 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipod-touch",
    "name": "Apple iPod touch",
    "description": "Apple iPod touch is the first iPod with touchscreen and Apple`s mobile platform iOS. It has 3.5\"  capacitive display, Wi-Fi, accelerometer, music and video player.",
    "phonearenaRating": "91",
    "userRating": "9",
    "announceDate": "Sep 13, 2007",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27972-large/Apple-iPod-touch.jpg",
    "weight": "4.20 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-4",
    "name": "Apple iPad 4",
    "description": "The fourth-generation iPad keeps the amazing screen resolution and general look and feel of its predecessor, but bumps up the specs with double the processing power and double the graphics power. The camera is also improved.\nThe new tablet adds a Lightning connector instead of the (not so) good old 30-pin connector. It also has faster Wi-Fi connectivity and expanded LTE.",
    "phonearenaRating": "9",
    "userRating": "9",
    "announceDate": "Oct 23, 2012",
    "status": "Released",
    "releaseDate": "Nov  2, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38594-xlarge/Apple-iPad-4.jpg",
    "weight": "23.35 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad",
    "name": "Apple iPad",
    "description": "Apple iPad is a 9.7-inch tablet that fills the gap between the iPhone and the Mac. There are 16, 32 or 64-gigabyte versions, each sporting a 1GHz Apple A4 processor and running Apple's iOS operating system, Wi-Fi 802.11n and Bluetooth 2.1 + EDR. The battery of the iPad is rated to be able to hold up for a month in standby and 10 hours of use time.",
    "phonearenaRating": "8",
    "userRating": "87.5",
    "announceDate": "Jan 27, 2010",
    "status": "Released",
    "releaseDate": "Apr  3, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/22488-large/Apple-iPad.jpg",
    "weight": "25.75 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-5s",
    "name": "Apple iPhone 5s",
    "description": "The iPhone 5s is not a radical departure in design for Apple, save for one very important feature. No, we don't mean the new Space Gray and Gold colors. We have in mind the home button that has been on iPhones from day one, is now turned into a fingerprint scanner dubbed Touch ID. It lets you unlock the phone and authorize purchases, safely storing your fingerprints in the A7 processor itself, out of the reach for anyone but a few default iOS 7 apps.\n\nThis A7 processor debuts on the iPhone 5s as the first 64-bit mobile chipset in use on a commercial device, utilized by the latest flat and minimalistic iOS 7 that has been rewritten to take advantage of the 64-bit system. It sports a dedicated M7 co-processor for always-on motion sensing, too.\n\nThe iSight camera stayed 8 MP, but is much improved, with larger pixels, wider aperture, and the ability to shoot slow motion videos, not to mention the dual two-tone LED flash on the back that strives for natural skin color representation.",
    "phonearenaRating": "93",
    "userRating": "9.38.7",
    "announceDate": "Sep 10, 2013",
    "status": "Released",
    "releaseDate": "Sep 20, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42885-xlarge/Apple-iPhone-5s.jpg",
    "weight": "3.95 oz",
    "size": "4.0 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-mini-3",
    "name": "Apple iPad mini 3",
    "description": "The iPad mini 3 is Apple's third-generation mini tablet, although technically, it is almost identical to its predecessor. The device offers a 7.9-inch Retina Display with a resolution of 2048 by 1536 pixels. Processing power is provided by an Apple-designed A7 system-on-chip, and up to 128GB of storage are available for storing files and media. In charge is the latest version of iOS, Apple's mobile operating system. All this is housed in a lightweight, 7.5-millimeter thin body made of premium aluminium. Unlike its predecessor, the iPad mini 3 has a Touch ID fingerprint scanner built into its home button.",
    "phonearenaRating": "8",
    "userRating": "810",
    "announceDate": "Oct 16, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49659-xlarge/Apple-iPad-mini-3.jpg",
    "weight": "12.03 oz",
    "size": "7.9 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-3-at&t",
    "name": "Apple iPad 3 AT&T",
    "description": "The Apple iPad 3 for AT&T, or simply iPad, as it is officially called, is Apple's latest foray in the contemporary tablet market - a market the company single-handedly started about two years ago. Although the third-generation iPad remains the same on the outside (not a bad thing), it does bring a lot of improvements on the inside. First of all, it has a new screen resolution of 2048x1536 pixels, delivering an amazing for a tablet pixel density of 264 ppi. Another major improvement has to do with the processor of the device, which is now the so-called A5X - still a dual-core processor, but with a new quad-core GPU for outstanding graphics performance. The camera has also been given a boost and is now much more capable in terms of both photo- and video-taking. Finally, the new iPad 3 has been blessed with LTE connectivity. Additionally, all 4G iPads will also have global 3G capabilities, so you should be able to use 3G on most carriers around the world.",
    "phonearenaRating": "9",
    "userRating": "9",
    "announceDate": "Mar  7, 2012",
    "status": "Released",
    "releaseDate": "Mar 16, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35297-xlarge/Apple-iPad-3-AT-T.jpg",
    "weight": "23.35 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-2-wi-fi",
    "name": "Apple iPad 2 Wi-Fi",
    "description": "The Wi-Fi-only iPad 2 version is the cheapest of them all, and also the lightest at 1.33 pounds (601 grams). It  improves on its predecessor in both desing and hardware, since the iconic tablet is now thinner even than the iPhone 4 at 0.34\" (8.8mm). It is powered by a 1 GHz dual-core Apple A5 chipset, which provides 2x the CPU and 9x the GPU performance of its predecessor. All that while keeping the same 10 hours of battery life. Dressed entirely in black or white this time, the iPad 2 sports HDMI output via a separate cable, as well as rear and front-facing cameras.",
    "phonearenaRating": "85",
    "userRating": "8.57.9",
    "announceDate": "Mar  2, 2011",
    "status": "Released",
    "releaseDate": "Mar 11, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27197-large/Apple-iPad-2-Wi-Fi.jpg",
    "weight": "21.20 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-3g",
    "name": "Apple iPhone 3G",
    "description": "Apple iPhone 3G adds support of 3G HSDPA fast data and GPS. It has the same screen, camera, OS and memory (8 or 16GB) as the first one, and almost the same design but now will accept any 3.5mm headphones. It will run on the new software version which support third party application thanks to the official SDK.",
    "phonearenaRating": "8",
    "userRating": "87.4",
    "announceDate": "Jun  9, 2008",
    "status": "Released",
    "releaseDate": "Jul 11, 2008",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/10530-large/Apple-iPhone-3G.jpg",
    "weight": "4.70 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipad-wi-fi",
    "name": "Apple iPad Wi-Fi",
    "description": "Apple iPad is a 9.7-inch tablet that fills the gap between the iPhone and the Mac. There are 16, 32 or 64-gigabyte versions, each sporting a 1GHz Apple A4 processor and running Apple's iOS operating system, Wi-Fi 802.11n and Bluetooth 2.1 + EDR. The battery of the iPad is rated to be able to hold up for a month in standby and 10 hours of use time.",
    "phonearenaRating": "8",
    "userRating": "8",
    "announceDate": "Jan 27, 2010",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/23152-xlarge/Apple-iPad-Wi-Fi.jpg",
    "weight": "23.99 oz",
    "size": "9.7 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-ipod-touch-3rd-generation",
    "name": "Apple iPod touch 3rd generation",
    "description": "Apple iPod touch 3rd generation is a portable media player running Apple`s iOS 3.1. It has 3.5\"  capacitive display, Wi-Fi, accelerometer, and  Bluetooth.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep  9, 2009",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27962-large/Apple-iPod-touch-3rd-generation.jpg",
    "weight": "4.05 oz",
    "size": "3.5 inches"
}, {
    "symbol": "AAPL",
    "company": "Apple",
    "codename": "apple-iphone-4",
    "name": "Apple iPhone 4",
    "description": "The iPhone 4 is now boxier, with the rear side now flat, instead of rounded.  It will keep the 3.5-inch display diagonal, but will quadruple the pixels to 640x960, making it the highest-resolution screen on a smartphone to date. Apple actually calls the new screen Retina Display, because it shows 326 pixels per inch, while the human eye can only distinguish around 300 ppi. In addition, the screen will utilize the LCD IPS  technology (same as in the iPad). The other new stuff includes a front-facing video call camera, 5MP main camera lens with LED flash and 720p HD video recording, Micro-SIM slot, instead of ordinary SIM, a secondary mic for noise-cancellation and a lot of other new features.",
    "phonearenaRating": "95",
    "userRating": "9.58.2",
    "announceDate": "Jun  7, 2010",
    "status": "Released",
    "releaseDate": "Jun 24, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/21284-large/Apple-iPhone-4.jpg",
    "weight": "4.83 oz",
    "size": "3.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-ultra",
    "name": "Motorola DROID Ultra",
    "description": "The Motorola Droid Ultra comes with a 5-inch HD display. The device is both thinner and more durable than earlier devices thanks to a new unibody kevlar construction. Thickness comes at the slim 7.18mm making this the thinnest 4G LTE phone out there. \n\nA brand new dual-core X8 Mobile Computing system is powering the device allowing exciting new features like ‘Touchless control’ that has your phone listening to you at all times, something we saw on the Moto X leaks. There's also the 'active display' technology that only lights up a part of the screen to conserve battery. Technically, a dual-core processor is what's under the hood, don't get fooled by the '8-core' talk in the event.\n\nThe Droid Ultra features an f/2.4 10-megapixel camera and chances are this is the same unit we'll see on the Motorola Moto X.",
    "phonearenaRating": "87",
    "userRating": "8.79.3",
    "announceDate": "Jul 23, 2013",
    "status": "Released",
    "releaseDate": "Aug 20, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42065-xlarge/Motorola-DROID-Ultra.jpg",
    "weight": "4.83 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-g-lte",
    "name": "Motorola Moto G LTE",
    "description": "The Motorola Moto G LTE is the LTE version of the Moto G blockbuster. The specs of the two phones are the same - a 4.5\" 720p display, Snapdragon 400 processor, 1 GB of RAM, and a 5 MP rear camera, but, besides the LTE radio, the Moto G LTE has another upgrade - the expandable storage. Yep, we are now having a Moto G with a microSD slot, so you can add up to 32 GB more memory to the 8 GB/16 GB that you get out of the box.",
    "phonearenaRating": "833",
    "userRating": "8.3",
    "announceDate": "May 13, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47058-xlarge/Motorola-Moto-G-LTE.jpg",
    "weight": "5.04 oz",
    "size": "4.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-razr-hd",
    "name": "Motorola DROID RAZR HD",
    "description": "Droid RAZR HD is Motorola's flagship with a huge 4.7-inch 720p Super AMOLED screen with no physical buttons, and the Qualcomm Snapdragon S4 chip with the processor clocked at 1.5GHz. The Motorola Droid RAZR HD runs on Android 4.0.4 Ice Cream Sandwich, but Motorola has promised it’d pay you back $100 if it doesn’t manage to update the phone to Jelly Bean by the end of the year. The Droid RAZR HD will of course run on Verizon's blazing-fast 4G LTE network and come with Chrome pre-loaded. The handset will also will feature a pretty capable 2,530mAh battery, a capacity surpassing the Droid RAZR by 40%.",
    "phonearenaRating": "85",
    "userRating": "8.59.5",
    "announceDate": "Sep  5, 2012",
    "status": "Released",
    "releaseDate": "Oct 18, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37943-xlarge/Motorola-DROID-RAZR-HD.jpg",
    "weight": "5.15 oz",
    "size": "4.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-i",
    "name": "Motorola RAZR i",
    "description": "The Motorola RAZR i became the first phone to clear the whopping 2GHz barrier, and it is powered by a mobile Intel Atom processor manufactured with a 32nm technology. Its 2, 000mAh battery allows all-day smartphoning, just like with the ARM-based processors on other Androids, and a 4.3\" edge-to-edge Super AMOLED display plus a snappy 8MP camera complete the package.",
    "phonearenaRating": "8",
    "userRating": "89",
    "announceDate": "Sep 18, 2012",
    "status": "Released",
    "releaseDate": "Oct  2, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37998-xlarge/Motorola-RAZR-i.jpg",
    "weight": "4.44 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-turbo",
    "name": "Motorola DROID Turbo",
    "description": "Packing arguably one of the best hardware combinations available at the moment, the natural habitat of the Motorola DROID Turbo is somewhere near the very top of Mount Android, thanks to the 5.2-inch Quad HD display, the power-laden 2.7GHz Snapdragon 805, the 3GB of LPDDR3 RAM, the 21MP rear snapper capable of shooting 4K video clips, and the humongous, \"two-day\" 3,900mAh battery inside.",
    "phonearenaRating": "92",
    "userRating": "9.29.5",
    "announceDate": "Oct 28, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49888-large/Motorola-DROID-Turbo.jpg",
    "weight": "6.21 oz",
    "size": "5.2 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-i485",
    "name": "Motorola i485",
    "description": "The Motorola i485 is a basic device with full QWERTY keyboard and 2.2'' display. It also offers B;uettoh, 2MP camera, FM radio and PTT.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep 20, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39714-large/Motorola-i485.jpg",
    "weight": "Shock, Vibration, Temperature resistant\n",
    "size": "2.2 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-defy-pro",
    "name": "Motorola DEFY PRO",
    "description": "Thanks to the physical QWERTY keyboard oriented in portrait mode, the Motorola DEFY PRO has a strong resemblance to a BlackBerry model, but adds IP67 certification which means it is resistant to spills and dust. The Motorola DEFY PRO offers a 2.7 inch touchscreen made from Gorilla Glass and is built to take all the abuse that someone with an active lifestyle heaps upon his smartphone. Speaking of active lifestyles, the Motorola DEFY PRO has a special dashboard that helps you track specific outdoor activities such as camping, hiking and a daily workout. There is both a 5MP rear-facing camera and a VGA shooter on front for self-portraits and video chat. Android 2.3 is installed.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jul 17, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37206-xlarge/Motorola-DEFY-PRO.jpg",
    "weight": "4.06 oz",
    "size": "2.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-motosmart",
    "name": "Motorola MOTOSMART",
    "description": "The Motorola MOTOSMART is an entry-level Android 2.3 Gingerbread trotting smartphone. It features a 3.5” HVGA (320 x 480) display, 3-megapixel camera, HSPA, Bluetooth, FM radio, Wi-Fi, 1,400 mAh battery, 165MB of internal storage, microSD card slot, and the MOTOSWITCH 2.0 UI running on top of Gingerbread.",
    "phonearenaRating": "91",
    "userRating": "9",
    "announceDate": "Jun  7, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36642-xlarge/Motorola-MOTOSMART.jpg",
    "weight": "4.06 oz",
    "size": "3.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-d1",
    "name": "Motorola RAZR D1",
    "description": "The Motorola RAZR D1 is an Android 4.1 phone. It comes with a 3.5'' display, single core CPU at 1 GHz, 4 GB internal memory, microSD card slot for up to 32 GB additional memory, and the standard array of connectivity switches of the mobile OS.",
    "phonearenaRating": "91",
    "userRating": "9",
    "announceDate": "Mar 14, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39890-xlarge/Motorola-RAZR-D1.jpg",
    "weight": "3.88 oz",
    "size": "3.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-maxx",
    "name": "Motorola DROID MAXX",
    "description": "Motorola DROID MAXX has a 3500 mAh battery, which is 200 mAh more than its predecessor, and the kind of capacity only phablets get equipped with nowadays, and cited for up to 48 hours of battery life. That capacity is keeping the lights on a very interesting set of specs - 5\" HD OLED display (not PenTile), 1.7 GHz homemade processor, 2 GB of RAM and 32 GB of internal memory. Exact dimensions go as follows: 137.5x71.20x8.5 mm, so pretty thin despite the giant battery, and fairly light for a 5-incher at 160 grams, or 5.6 ounces.\n\nThe \"Motorola X8 Mobile Computing System\" SoC sports 1.7 GHz dual-core application processor, 400 MHz quad-core GPU, natural language processor, and a contextual computing processor, for an octa-core concoction, claims Moto.\n\nThe 10 MP camera on the back sports the new ClearPixel technology, which applies different RGBC color filter than the traditional Bayer RGBG one, bringing in more photons at low-light scenarios thus dealing better with blur and noise, at least on theory.",
    "phonearenaRating": "85",
    "userRating": "8.59.8",
    "announceDate": "Jul 23, 2013",
    "status": "Released",
    "releaseDate": "Aug 20, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42071-xlarge/Motorola-DROID-MAXX.jpg",
    "weight": "5.89 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-maxx",
    "name": "Motorola RAZR MAXX",
    "description": "Motorola RAZR MAXX is the GSM version of the aforementioned DROID RAZR MAXX. It drops the LTE radio in favor of an HSPA+ one. Other than that, the two devices are pretty much identical. The Android powered Motorola RAZR MAXX packs a 4.3-inch Super AMOLED Advanced display with qHD resolution. Inside it ticks a 1.2GHz dual-core processor accompanied by a gig of RAM. Turn the smartphone around and you will see its 8-megapixel auto-focus camera, but what will also catch your eye is the KEVLAR-made back cover. Surprisingly, the unit itself is only 9 millimeters thick despite having a 3,300mAh battery inside of it. And that amount of juice should be enough to provide the impressive 17 hours of talk time.",
    "phonearenaRating": "85",
    "userRating": "8.59.2",
    "announceDate": "Apr  3, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35700-xlarge/Motorola-RAZR-MAXX.jpg",
    "weight": "5.11 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-i418",
    "name": "Motorola i418",
    "description": "The Motorola i418 is a slim iDEN basic phone. It offers camera, Bluetooth and a 2.2'' color screen, and also Micro GPS and microSD Memory Card Slot.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Dec  6, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39342-large/Motorola-i418.jpg",
    "weight": "Dust, Shock, Vibration, Temperature, Humidity resistant\n",
    "size": "2.2 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-razr-maxx",
    "name": "Motorola DROID RAZR MAXX",
    "description": "Motorola DROID RAZR MAXX is a slightly thicker twin of the DROID RAZR, coming with a larger battery to boost its battery life. All other specs remain the same.",
    "phonearenaRating": "85",
    "userRating": "8.58.7",
    "announceDate": "Jan  9, 2012",
    "status": "Released",
    "releaseDate": "Jan 26, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/34431-xlarge/Motorola-DROID-RAZR-MAXX.jpg",
    "weight": "5.11 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-m",
    "name": "Motorola RAZR M",
    "description": "Motorola RAZR M is the RAZR HD's little brother. A pretty compact Android smartphone with a spacious qHD screen, beefy battery, and premium design. Then here is what you need to know about the Motorola RAZR M: first of all, it comes with an edge-to-edge, almost bezel-less 4.3-inch display with qHD resolutin (540 by 960 pixels). The panel is built using Super AMOLED Advanced technology, much like what we had on the very first RAZR. Processing power is delivered by a dual-core processor clocked at 1.5GHz and backed up by 1GB of RAM - a hardware combo that is identical to what makes the RAZR HD tick. There is an 8-megapixel autofocus camera with LED flash on its back, and a VGA cam up front for video chats.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep  5, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37954-xlarge/Motorola-RAZR-M.jpg",
    "weight": "4.44 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-v",
    "name": "Motorola RAZR V",
    "description": "The Motorola RAZR V is a thin Kevlar smarthone running on Android 4.0. It offers a 4.3'' display along with a 1.2GHz dual-core processor, 1 GB RAM, Internal ROM 4 GB, expandable by up to 32 GB with microSD card, and all the perks of its smart platform.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  1, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39866-large/Motorola-RAZR-V.jpg",
    "weight": "4.59 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-atrix-hd",
    "name": "Motorola ATRIX HD",
    "description": "Motorola ATRIX HD has a DROID RAZR style body with the now familiar Kevlar back. The 4.5 inch HD screen offers ColorBoost for vibrant colors and sharper images. It has 720 x 1280 pixels resolution and comes with Gorilla Glass. The nanocoated insides help prevent the Motorola ATRIX HD from a death by water. There is a dual-core 1.5GHz processor under the hood, 1 GB of RAM and 8GB of internal storage on board. An 8MP camera is on back, not the 13MP shooter once rumored, and there is a 1.3MP front-facing shooter. Android 4.0 is installed out of the box and it would appear that there are no physical Android navigation buttons. The battery is 1780 mAh. ATRIX HD is a quad-band GSM and quad-band HSPA global phone with support for AT&T's 4G LTE network. For those who keep track, the device is Motorola's model number MB886.",
    "phonearenaRating": "8",
    "userRating": "88.9",
    "announceDate": "Jul 10, 2012",
    "status": "Released",
    "releaseDate": "Jul 15, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37151-xlarge/Motorola-ATRIX-HD.jpg",
    "weight": "4.94 oz",
    "size": "4.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-d3",
    "name": "Motorola RAZR D3",
    "description": "The Motorola RAZR D3 is a mid-range smartphone coming with Android 4.1. On the hardware side the device is packing a 4\" display, dual-core CPU at 1.2 GHz, 1GB RAM, 4GB internal memory, microSD card slot, and all the perks of the Green robot.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar 14, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39895-xlarge/Motorola-RAZR-D3.jpg",
    "weight": "4.23 oz",
    "size": "4.0 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-razr-hd",
    "name": "Motorola RAZR HD",
    "description": "RAZR HD is Motorola's flagship with a huge 4.7-inch 720p Super AMOLED screen with no physical buttons, and the Qualcomm Snapdragon S4 chip with the processor clocked at 1.5GHz. The Motorola RAZR HD runs on Android 4.0.4 Ice Cream Sandwich, but Motorola has promised that they will update the phone to Jelly Bean by the end of the year. The RAZR HD will run on blazing-fast 4G LTE networks and come with Chrome pre-loaded. The handset will also will feature a pretty capable 2,530mAh battery, a capacity surpassing the RAZR by 40%.",
    "phonearenaRating": "885",
    "userRating": "8.8",
    "announceDate": "Sep  5, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37956-xlarge/Motorola-RAZR-HD.jpg",
    "weight": "5.15 oz",
    "size": "4.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-motogo!",
    "name": "Motorola MOTOGO!",
    "description": "Motorola MOTOGO! EX430 is a basic phone with QWERTY keyboard featuring a 2.2\" display, 2MP camera and Wi-Fi.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep 11, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37982-xlarge/Motorola-MOTOGO.jpg",
    "weight": "",
    "size": "2.2 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-g-(2014)",
    "name": "Motorola Moto G (2014)",
    "description": "While most of the buzz has been for its brother the new Moto X, there is officially a new Moto G as well. Of course, there isn't exactly all that much that is new about the device, as it shares quite a bit in common with last year's Moto G. The major difference this year is in the design of the device, while the internals are only a modest update overall compared to last year's Moto G. On the outside, the changes can be summed up in two points: the display is now 5-inches rather than 4.5, and there are stereo front speakers. That's about it. On the inside, the cameras have gotten modest updates (8-megapixels in the rear and 2-megapixels in the front compared to 5MP and 1.3MP), and there is now a microSD card slot. Otherwise, the device has the same Snapdragon 400, 1GB of RAM, swappable shells, and software offerings.",
    "phonearenaRating": "85",
    "userRating": "8.59.6",
    "announceDate": "Sep  5, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48890-xlarge/Motorola-Moto-G-2014.jpg",
    "weight": "5.26 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-razr-m",
    "name": "Motorola DROID RAZR M",
    "description": "Motorola DROID RAZR M is the DROID RAZR HD's little brother. A pretty compact Android smartphone with a spacious qHD screen, beefy battery, and premium design. Then here is what you need to know about the Motorola DROID RAZR M: first of all, it comes with an edge-to-edge, almost bezel-less 4.3-inch display with qHD resolutin (540 by 960 pixels). The panel is built using Super AMOLED Advanced technology, much like what we had on the very first DROID RAZR. Processing power is delivered by a dual-core processor clocked at 1.5GHz and backed up by 1GB of RAM - a hardware combo that is identical to what makes the DROID RAZR HD tick. There is an 8-megapixel autofocus camera with LED flash on its back, and a VGA cam up front for video chats.",
    "phonearenaRating": "85",
    "userRating": "8.59.1",
    "announceDate": "Sep  5, 2012",
    "status": "Released",
    "releaseDate": "Sep 10, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37950-xlarge/Motorola-DROID-RAZR-M.jpg",
    "weight": "4.44 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-photon-q-4g-lte",
    "name": "Motorola PHOTON Q 4G LTE",
    "description": "Motorola PHOTON Q 4G LTE is a side-sliding global roaming Android smartphone with QWERTY keyboard and LTE support. Other features include a 4.3\" display, 8MP camera, NFC and microSD memory slot.",
    "phonearenaRating": "7",
    "userRating": "77.3",
    "announceDate": "Jul 26, 2012",
    "status": "Released",
    "releaseDate": "Aug 19, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37353-xlarge/Motorola-PHOTON-Q-4G-LTE.jpg",
    "weight": "6.00 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-electrify-2",
    "name": "Motorola ELECTRIFY 2",
    "description": "Motorola ELECTRIFY 2 is the follow up successor to the original ELECTRIFY from last year. Similar to Verizon’s DROID RAZR, the Motorola ELECTRIFY 2 has all the awesome specs to make it a standout leader amongst the carrier's existing crop. In fact, this beauty boasts many of the exquisite elements that we find with Verizon’s DROID RAZR – like its svelte 8.4mm body, invisible splash-guard coasting, and Kevlar strong backing. Beyond that, its specs sheet is able to impress thanks to its 4.3” qHD ColorBoost display, dual-core 1.2GHz processor, 8-megapixel rear camera, and 1080p video capture. On the software side, customers will be pleased to know it’s running Android 4.0 Ice cream Sandwich out of the box – with Motorola’s SMARTACTIONS functionality to extend its performance and battery life.",
    "phonearenaRating": "82",
    "userRating": "8",
    "announceDate": "Aug  1, 2012",
    "status": "Released",
    "releaseDate": "Aug  1, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37470-xlarge/Motorola-ELECTRIFY-2.jpg",
    "weight": "4.59 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-defy-xt",
    "name": "Motorola DEFY XT",
    "description": "The Motorola DEFY XT is a smartphone with Andrdoid 2.3, 3.7'' display, 5MP camera and a front-facing shooter, 1GHz processor, 1GB ROM / 512MB RAM, GPS and aGPS, as well as the standard features of the platform.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Aug  2, 2012",
    "status": "Released",
    "releaseDate": "Aug  3, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37468-large/Motorola-DEFY-XT.jpg",
    "weight": "4.59 oz",
    "size": "3.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-gleam+",
    "name": "Motorola GLEAM+",
    "description": "Motorola GLEAM+ is a basic but yet stylish looking feature phone coming with a fancy LED matrix display that provides expressive notifications and alerts. Other features include a 2.8” WQVGA main display, 2MP camera, FM Radio, music player and microSD card slot for up to 16GB of additional memory.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Feb  9, 2012",
    "status": "Released",
    "releaseDate": "Apr  4, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/34938-large/Motorola-GLEAM.jpg",
    "weight": "",
    "size": "2.8 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-razr-maxx-hd",
    "name": "Motorola DROID RAZR MAXX HD",
    "description": "Just like last year, Motorola is making a souped-up version of its RAZR HD, the RAZR MAXX HD. This year it has the HD after its name, hinting that Moto is finally joining the high-res screen party, but will upgrade where it matters again - the battery. The Motorola DROID RAZR MAXX HD will sport the same 4.7\" Super AMOLED HD screen as its non-Maxx version (what, Samsung is lending those to others now?), and dual-core Snapdragon S4, but will sport a huge 3, 300mAh battery, just like last year. This will allow it the impressive 13 hours of video playback, 21 hours of talk time, 10 hours of streaming video and 27 hours of streaming music over Verizon's LTE network.",
    "phonearenaRating": "87",
    "userRating": "8.79.7",
    "announceDate": "Sep  5, 2012",
    "status": "Released",
    "releaseDate": "Oct 18, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37947-xlarge/Motorola-DROID-RAZR-MAXX-HD.jpg",
    "weight": "5.54 oz",
    "size": "4.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-g-lte-(2015)",
    "name": "Motorola Moto G LTE (2015)",
    "description": "Although almost similar to its 3G-only counterpart, the new Moto G LTE (2015) boasts a few pretty interesting hardware differences in its specs sheet. The most notable one is, naturally, the on-board LTE connectivity. The second noteworthy specs sheet difference is the bigger battery - the LTE-enabled Moto G (2015) comes with a 2,390mAh battery (as a refresher, the 3G-only version has a \"merely\" 2,070mAh one). The larger battery at the back has not resulted in an increased waistline, mind you - the phone is still 11mm thick, but it's slightly heavier (155gr vs 149gr). Unlike the 3G-only Moto G (2014), the LTE-compliant one comes in a dual-SIM version only; it's also only available with 16GB of native storage. In conclusion, the device comes with Android 5.0 Lollipop out of the box.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Feb  2, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51529-large/Motorola-Moto-G-LTE-2015.jpg",
    "weight": "5.47 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-xt928",
    "name": "Motorola XT928",
    "description": "The Motorola XT928 is China's version of the the Motorola RAZRs. With a 4.5'' 720x1280 px display, dual-core processor at 1.2GHz, 16GB internal storage, and 1GB RAM it is a powerhouse. It comes flaunting Bluetooth 4, Gorilla Glass, 13 MP shooter with dual flash, and all the standard Android features.",
    "phonearenaRating": "91",
    "userRating": "9",
    "announceDate": "Feb 23, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35081-xlarge/Motorola-XT928.jpg",
    "weight": "5.26 oz",
    "size": "4.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-e",
    "name": "Motorola Moto E",
    "description": "The Moto E continues on the design legacy of the Moto X and Moto G, with a similar slightly chubby, curvy form with a dimple on the back. The handset comes with a 4.3-inch display with a resolution of 540 x 960 pixels (qHD). This might sound low on paper, but on this small screen, it works out to the very sharp pixel density of 256ppi. Best of all, the Moto E runs on the latest Android 4.4 KitKat. The little new Moto features a Snapdragon 200 system chip with 1.2GHz dual-core Cortex A7-based processor and an Adreno 302 GPU. There’s 1GB of RAM, and a scarce 4GB of internal storage (only 2.2GB available to end users!) that you can, luckily, expand via microSD cards. It’s also got a 5-megapixel camera (no flash in sight) capable of recording videos with 480 x 854-pixel resolution at 30 frames per second.",
    "phonearenaRating": "9",
    "userRating": "99.5",
    "announceDate": "May 13, 2014",
    "status": "Released",
    "releaseDate": "May 13, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47057-xlarge/Motorola-Moto-E.jpg",
    "weight": "5.01 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-x",
    "name": "Motorola Moto X",
    "description": "The revolutionary Moto X lets you customize every nook and cranny of the outer appearance, down to your own boot animation, and headphones to match your back cover color. Every aspect of the phone was rehashed in line with the function it performs, rather than chasing the specs-o-meter. Moto went with OLED, as it makes possible the Active Display notification function, but it is a standard RGB matrix OLED, so you still get plenty of true pixel density, \"without wasting power on pixels most people can't see\". \n\nThe X8 processor might have \"just\" two CPU cores, but it is rethought from the ground up to make the always-on environmental awareness of the phone possible with power-sipping extra processing cores. The 10 MP camera might not be in line with the 13 MP on current flagships, but is the first to utilize the Clear Pixel technology that lets it soak much more light, and so on.",
    "phonearenaRating": "85",
    "userRating": "8.59.5",
    "announceDate": "Aug  1, 2013",
    "status": "Released",
    "releaseDate": "Aug 23, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42274-xlarge/Motorola-Moto-X.jpg",
    "weight": "4.59 oz",
    "size": "4.7 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-electrify-m",
    "name": "Motorola ELECTRIFY M",
    "description": "The Motorola Electirfy M is an Android 4.0 smartphone for U.S. Cellular that sports 4.3-inch Super AMOLED Advanced display, 4G LTE, 1.5 GHz dual-core CPU, 1GB of RAM, 8-megapixel shooter with 1080p video capture and all of the connectivity features we've come to expect from an Android smartphone.",
    "phonearenaRating": "94",
    "userRating": "9",
    "announceDate": "Nov  1, 2012",
    "status": "Released",
    "releaseDate": "Nov  8, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38838-xlarge/Motorola-ELECTRIFY-M.jpg",
    "weight": "3.92 oz",
    "size": "4.3 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-g",
    "name": "Motorola Moto G",
    "description": "Looking at its specs sheet, we're surprised to see how much bang the Moto G can deliver for its money. First and foremost, our eyes are treated to a 4.5-inch \"edge-to-edge\" LCD display with a resolution of 720 by 1280 pixels. This gives us a figure of around 329ppi, which nothing short of great given the phone's cost. A layer of Gorilla Glass 3 protects the screen against light scratches. Then there's the processor ticking inside of the Moto G – a 1.2GHz, quad-core Snapdragon 400 silicon, which is no slouch by any means. 1GB of RAM is available on the device.",
    "phonearenaRating": "9",
    "userRating": "99",
    "announceDate": "Nov 13, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/43971-xlarge/Motorola-Moto-G.jpg",
    "weight": "5.04 oz",
    "size": "4.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-x-(2014)",
    "name": "Motorola Moto X (2014)",
    "description": "With the new Moto X we are getting a 5.2-inch AMOLED display running at 1080p, a customized Snapdragon 801 clocked at 2.5GHz, 2GB of RAM, a 13-megapixel camera, and a 2300mAh battery. The device measures 72.4 x 140.8mm (~2.85 x 5.54-inches) and the width ranges from 3.8 mm (0.15-inches) at the edge to 9.9mm (0.39-inches) at in the middle, and it will weigh 144 g (5.08oz). Sadly, the back logo is not a button, although it does look like one. But, the edge-to-edge design means that Motorola has been able to fit a slightly larger display in the same device width as the Samsung Galaxy S5.",
    "phonearenaRating": "88",
    "userRating": "8.89.4",
    "announceDate": "Sep  4, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49882-large/Motorola-Moto-X-2014.jpg",
    "weight": "5.08 oz",
    "size": "5.2 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-i867",
    "name": "Motorola i867",
    "description": "Motorola i867 is a rugged iDEN smartphone running Android 2.1 with Push to Talk capabilities. It features a 3.1\" TFT touch screen, 3MP camera, Wi-Fi, GPS, and microSDHC card slot.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Feb 19, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/35015-large/Motorola-i867.jpg",
    "weight": "4.55 oz",
    "size": "3.1 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-moto-e-(2015)",
    "name": "Motorola Moto E (2015)",
    "description": "The new Moto E has both LTE, and non-LTE variants. The handset is powered by a quad-core 1.2 GHz Qualcomm processor (a Snapdragon 410 on the LTE version, and a Snapdragon 200 on the 3G-only version), and comes with a 4.5-inch, 540 x 960 pixels display - thus being slightly larger than the 2014 model. Other features include a 5 MP rear camera with 720p video recording, VGA front-facing camera, 1 GB of RAM, 8 GB of expandable internal memory, and a 2390 mAh battery that's \"designed to last all day.\"",
    "phonearenaRating": "8",
    "userRating": "8",
    "announceDate": "Feb 25, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51859-xlarge/Motorola-Moto-E-2015.jpg",
    "weight": "5.11 oz",
    "size": "4.5 inches"
}, {
    "symbol": "MSI",
    "company": "Motorola",
    "codename": "motorola-droid-mini",
    "name": "Motorola DROID Mini",
    "description": "Motorola DROID Mini aims to be a compact Android smartphone that makes no compromise with regards to speed and capability, similarly to what HTC's planning to do with its One mini. The DROID Mini is said to feature all the power of the DROID Ultra, but in a smaller package with a screen of 4.3 inches and a resolution of 720x1280 pixels.",
    "phonearenaRating": "85",
    "userRating": "8.59.7",
    "announceDate": "Jul 23, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42073-xlarge/Motorola-DROID-Mini.jpg",
    "weight": "4.59 oz",
    "size": "4.3 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z4",
    "name": "Sony Xperia Z4",
    "description": "The Sony Xperia Z4 features a 5.2-inch screen with a resolution of 1080 x 1920. It is powered by a 64-bit octa-core Snapdragon 810. 3GB of RAM is inside along with 32GB of native storage. Those requiring more memory can take advantage of the 128GB capacity microSD slot on board. A 20.7MP camera is on back with a wide angle 5.1MP snapper on front for selfies and video chats. A 2930mAh battery will keep the lights on, and Android 5.0 is pre-installed. The Sony Xperia Z4 will be available in White, Black, Copper and Aqua Green. The handset is IP6 certified for dust and IP5 and IP8 certified for water.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Apr 20, 2015",
    "status": "Announced",
    "releaseDate": "unknown",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52739-xlarge/Sony-Xperia-Z4.jpg",
    "weight": "5.08 oz",
    "size": "5.2 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-m4-aqua",
    "name": "Sony Xperia M4 Aqua",
    "description": "The Sony Xperia M4 Aqua is an IP68 certified Android phone. It features 1.7GHz, 64-bit octa-core processor, 13 megapixels main camera, 5 megapixels front shooter and supports LTE.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  2, 2015",
    "status": "Announced",
    "releaseDate": "First half 2015",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51878-xlarge/Sony-Xperia-M4-Aqua.jpg",
    "weight": "4.80 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e3",
    "name": "Sony Xperia E3",
    "description": "The Sony Xperia E3 is the successor to Sony Xperia E and Xperia E1. Its features include a 4.5-inch display with 480 x 854 pixels, 1GB of RAM, and a quad-core Snapdragon 400 processor clocked at 1.2 GHz. Android 4.4 KitKat is on board. Unlike the devices included in the Z3 series, the Xperia E3 won’t be water-resistant.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Sep  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48790-xlarge/Sony-Xperia-E3.jpg",
    "weight": "5.07 oz",
    "size": "4.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z2-tablet",
    "name": "Sony Xperia Z2 Tablet",
    "description": "The Xperia Tablet Z is still one of the most highly coveted Android tablets in its class. It is only natural to have high expectations about its successor. Then again, the Xperia Tablet Z was so complete that it didn't leave that much room for improvement over a year. This isn't to say it didn't have any weak spots. For example, the Xpera Tablet Z2's 10.1-inch display has been reworked for the better. It offers better color reproduction and viewing angles compared to the Xperia Tablet Z1. Colors retain their consistency and distortion has been eliminated. On top of that, the Xpera Tablet Z2 manages to shave off some weight and thickness, while growing some additional muscle with Qualcomm's latest Snapdragon 801 CPU and 3GB of RAM.  Everything else is largely the same. The design, the 6000mAh battery and the 2.2MP front/8MP rear cameras have all been preserved from last year. Although not innovative, the Xperia Tablet Z2 is durable, slick, and a great high-end slate overall.",
    "phonearenaRating": "9",
    "userRating": "910",
    "announceDate": "Feb 24, 2014",
    "status": "Released",
    "releaseDate": "Mar 29, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/45596-xlarge/Sony-Xperia-Z2-Tablet.jpg",
    "weight": "15.49 oz",
    "size": "10.1 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e4",
    "name": "Sony Xperia E4",
    "description": "Specs-wise, the Xperia E4 is as upper entry-level as it gets. A 5-inch IPS LCD display with a resolution of 540 x 960 pixels will try to seduce your eyesight and a quad-core MediatTek MT6582 chipset, clocked at up to 1.3GHz, will cater to your needs. The Xperia E4 also comes with 1GB of RAM, 8GB of native storage (roughly 5 of which are available to the user), a microSD card slot, a 5MP rear camera, and a 2MP front-facing selfie snapper. We have no LTE on board, but at least the device comes in two versions - single- and dual-SIM ones. The OS of choice is Android 4.4.4 KitKat.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Feb 10, 2015",
    "status": "Announced",
    "releaseDate": "unknown",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51596-xlarge/Sony-Xperia-E4.jpg",
    "weight": "5.08 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z4-compact",
    "name": "Sony Xperia Z4 Compact",
    "description": "The Xperia Z4 Compact is expected to sport a 4.7\" Quad HD Triluminos display and an IP68 certification. The phone will catch quite a buzz if it features the Snapdragon 810 processor, 4GB of RAM, 32GB of native storage, and 3000mAh battery, as rumored. The Z4 Compact will be running Android 5.0 Lollipop.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jan 19, 2015",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-l",
    "name": "Sony Xperia L",
    "description": "Sony Xperia L is a stylish mid-range device that stands out primarily with photographic skills. There's an 8MP camera on its back with an Exmor RS sensor that enables cool features like HDR mode while shooting photos or video, just like on the Xperia Z flagship. In addition, you get a dedicated shutter key that can snap a photo in under a second straight from the lock screen. \nOther than that, the Sony Xperia L is your typical mid-range device. It is powered by a dual-core Snapdragon S4 Plus SoC - the Qualcomm MSM8230 running at 1GHz. The 4.3-inch screen has a resolution of 854 by 480 pixels so it isn't quite HD, although it should meet the needs of the average consumer. You can have the smartphone in any color, as long as it is black, white, or red. The exact capacity of the Xperia L battery has not been disclosed, but it should be capable of delivering up to 8 hours and 30 minutes of continuous talk time, or 7 hours and 36 minutes of video playback. Android 4.1 Jelly Bean comes out of the box, sprinkled with a number of interface tweaks on top.",
    "phonearenaRating": "65",
    "userRating": "6.59.2",
    "announceDate": "Mar 18, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40183-xlarge/Sony-Xperia-L.jpg",
    "weight": "4.83 oz",
    "size": "4.3 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-t3",
    "name": "Sony Xperia T3",
    "description": "The Sony Xperia T3 has IPS-LCD Triluminos screen with 720x1280 pixels resolution. The processing power is a bit on the slow side for today's standards, as the phone gets powered by a 1.4 GHz quad-core Qualcomm Snapdragon 400 processor, but this is the new midrange now, and it looks pretty svelte with the 150.7 x 77 x 7 mm chassis, built around a stainless steel frame. The memory situation includes 1 GB of RAM, 8 GB of internal storage, and a microSD slot that takes up to 32 GB cards. There is an 8 MP Exmor RS sensor on the back for snapping and 1080p video purposes, and a 1.1 MP front-facing camera that does 720p recordings. Power is provided by a 2500 mAh battery. Naturally, Android 4.4 KitKat with Sony's own Xperia UI are loaded on the handset, too.",
    "phonearenaRating": "65",
    "userRating": "6.510",
    "announceDate": "Jun  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47385-xlarge/Sony-Xperia-T3.jpg",
    "weight": "5.22 oz",
    "size": "5.3 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z2",
    "name": "Sony Xperia Z2",
    "description": "The water and dust-resistant Xperia Z2 comes only six months after the previous Xperia Z1 flagship was released. Although it's quick update, the Xperia Z2 features a larger, 5.2-inch IPS display that boasts a new imaging technology, called Live Color LED. Of course, the screen is not the only improvement over its predecessor. Although it's even thinner and lighter, the Xperia Z2 runs on the brand new 2.3 GHz quad-core Snapdragon 801 chipset, paired with a fantastic 3 GB of RAM. The 20.7MP camera on its back is capable of 4K recording, slow-motion video, and adding real-time effects. Stereo speakers are now available, as well as noise cancellation and many more software and hardware extras. The Xperia Z2 is powered by a 3200mAh battery, which considerably improves talk time. It runs the latest Android version, 4.4 KitKat. All things considered, the Z2 is an improvement in every way.",
    "phonearenaRating": "92",
    "userRating": "9.29.1",
    "announceDate": "Feb 24, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/45592-xlarge/Sony-Xperia-Z2.jpg",
    "weight": "5.75 oz",
    "size": "5.2 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z3v",
    "name": "Sony Xperia Z3v",
    "description": "The Sony Xperia Z3v is a model made exclusively for Verizon. It offers a 5.2 inch Triluminos screen with resolution of 1080 x 1920. A quad-core 2.5GHz Snapdragon 801 is under the hood with 3GB of RAM and 32GB of native storage. A 128GB capacity microSD slot is available for those who need more memory. The rear-facing camera weighs in at 20.7MP (with 4K video recording) and a 3200mAh battery keeps the lights on for as long as three days. With its IP68 certification, the Sony Xperia Z3v offers protection from dust and water. And the phone can connect to a PlayStation 4 Dual-Shock controller to play the console's games.",
    "phonearenaRating": "85",
    "userRating": "8.59.4",
    "announceDate": "Sep  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49456-large/Sony-Xperia-Z3v.jpg",
    "weight": "6.02 oz",
    "size": "5.2 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z",
    "name": "Sony Xperia Z",
    "description": "The specs on the Xperia Z are what we expected from the rumors. It will be a 5\" 1080p display, a 1.5GHz quad-core Snapdragon processor, 2GB of RAM, LTE, a 2330mAh battery, and the highly anticipated new 13MP Exmor RS camera sensor. As we saw in leaked images, the Exmor RS camera sensor will allow for HDR video recording, and a newly announced feature is that it will also offer a 10fps burst mode at 9MP. The phone also has NFC and a microSD card for those of you looking for that. \nAn interesting addition to the Xperia Z is that the phone will be water resistant to a depth of one meter. To achieve this, the Xperia Z has glass panels on the front and back, as well as plastic strips on the sides that cover the ports. And, they cover all of the ports from microSD card slot, to headphone jack, to microUSB. \nThe phone will be running Android 4.1 Jelly Bean, which is part of the reason why the March release date is so disappointing, because that will be coming up on Google I/O and the expected announcement of Android 5.0, although Sony has promised an upgrade to 4.2 \"soon after launch\".",
    "phonearenaRating": "85",
    "userRating": "8.59.2",
    "announceDate": "Jan  7, 2013",
    "status": "Released",
    "releaseDate": "Feb  9, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39559-xlarge/Sony-Xperia-Z.jpg",
    "weight": "5.15 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-j",
    "name": "Sony Xperia J",
    "description": "Sony Xperia J, the latest affordable addition to the Xperia lineup sports a 4\" screen with decent for the size 480x854 pixels of resolution, a humble 1GHz Snapdragon processor and has 512MB of RAM plus a 5MP camera on the back that records VGA video -all specs that are ensuring its entry level status. Internal memory is 4GB, but thankfully we have a microSD card slot to expand that with up to 32GB more. The showstopper here is the battery - it is not every day that we see a 1750mAh in a 4\" affordable device, and Sony is quoting the excellent 8 hours and 30 minutes of video playback with it. The curvy, easy to handle 9mm thin chassis of the Xperia J is arriving in white, pink, black and gold colors, to suit every taste.",
    "phonearenaRating": "5",
    "userRating": "57",
    "announceDate": "Aug 29, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37756-xlarge/Sony-Xperia-J.jpg",
    "weight": "4.37 oz",
    "size": "4.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z4-ultra",
    "name": "Sony Xperia Z4 Ultra",
    "description": "The Sony Xperia Z4 Ultra, it is said to feature a 6.44\" Triluminos display, the same Snapdragon 810 chipset with 4 GB of RAM as the Z4, but a lower-resolution, 16 MP camera with dual LED flash. Its other selling point will be an extremely thin chassis, to the tune of the amazing 5.7mm. Knowing Sony, and the fact that the original Z Ultra was long the thinnest smartphone on the market, we are inclined to believe that number.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Nov 24, 2014",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z3-tablet-compact",
    "name": "Sony Xperia Z3 Tablet Compact",
    "description": "Sony did it again, unveiling the world's thinnest, lightest and most-waterproof 8\" tablet, under the name of Xperia Z3 Tablet Compact. The Z3 Tablet Compact is just 6.4mm thin, or as much as the 10\" Xperia Z2 Tablet, making them both the thinnest states in the world. The Z3 Tablet Compact doesn't stop here, though, as it also introduces a very high for such a slim mobile device dust- and waterproof rating - IP58/68 certification - meaning that you can dive with it in up to 1.5 meters of water, and still be able to watch a full \"Finding Nemo\" down there, without the tablet skipping a beat.",
    "phonearenaRating": "88",
    "userRating": "8.810",
    "announceDate": "Sep  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48744-xlarge/Sony-Xperia-Z3-Tablet-Compact.jpg",
    "weight": "8.40 x 4.87 x 0.25 inches  (213.4 x 123.6 x 6.4 mm)",
    "size": "8.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z1",
    "name": "Sony Xperia Z1",
    "description": "The Xperia Z1 is Sony’s Android flagship for the second half of 2013. The Xperia Z1 features a 20-megapixel camera with a large sensor and Sony’s G Lens, a 5-inch 1080p display, and all of that is wrapped in a water-resistant body. Under the hood, the Z1 runs on a Snapdragon 800 chip with 2GB of RAM.",
    "phonearenaRating": "92",
    "userRating": "9.29.4",
    "announceDate": "Sep  4, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42817-xlarge/Sony-Xperia-Z1.jpg",
    "weight": "6.00 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e",
    "name": "Sony Xperia E",
    "description": "Sony Xperia E is an affordable and compact for today's standards featuring Sony's recognizable design language. The stand-out feature Sony wants us to note in the Xperia E is HD Voice, the purpose of which is to noticeably boost the sound quality of phone calls. When it comes to specs, the Xperia E will deliver a mid-range experience with its 3.5\" HVGA touchscreen and 1GHz processor. Let's hope that Jelly Bean's Project Butter will help get rid of the lag. Sony also claims that we'll be surprised by the battery life of the device. The 1500 mAh battery will benefit from a special extended stand-by mode designed to increase overall battery life. Basically, when the phone's sleeping, it will disable all functions except for calling and messaging, and once you wake it up, all functions will be restored to their normal state. Of course, users will be able to enjoy Sony's \"Walkman\" music experience, as well as the xLOUD sound technology, which works really well in most Sony smartphones.",
    "phonearenaRating": "7",
    "userRating": "75.8",
    "announceDate": "Dec  5, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39330-xlarge/Sony-Xperia-E.jpg",
    "weight": "4.08 oz",
    "size": "3.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-zr",
    "name": "Sony Xperia ZR",
    "description": "Sony Xperia ZR is compliant with IP55 and IP58 for dust and water resistance. That means it can be used under water to depths of 1.5 meters (just under 5 feet) for up to 30 minutes.\nThe CPU is a Qualcomm Snapdragon S4 quad-core unit tuned to 1.5GHz. Android 4.1 Jelly Bean is on board with 2GB of RAM and 8GB of storage (microSD up to 32GB). The display is 4.55-inches, TFT 1280x720 which works out to 323PPI. The main camera is a 13MP Exmor RS sensor.",
    "phonearenaRating": "65",
    "userRating": "6.58.8",
    "announceDate": "May 13, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40869-xlarge/Sony-Xperia-ZR.jpg",
    "weight": "4.87 oz",
    "size": "4.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-m2",
    "name": "Sony Xperia M2",
    "description": "The Sony Xperia M2 has grown considerably, and its display now measures in at 4.8-inches. In comparison, the amount of pixels went through only a minor update - a 540x960 qHD resolution. The processor, now a respectable 1.2GHz quad-core Snapdragon 400, has also seen an upgrade, and allows the Xperia M2 to hook up to a 4G LTE network. While on the topic of connectivity, its worth pointing out that the M2 will also come in a dual SIM version. The rest of the hardware highlights include an 8-megapixel camera, with Sony's proven Exmor RS sensor, 1GB of RAM and 8GB of internal storage, and a fairly large, 2300mAh battery. The M2 will come in the three signature Xperia colors: black, white and purple, and will see a global launch starting April 2014.",
    "phonearenaRating": "5",
    "userRating": "58.8",
    "announceDate": "Feb 24, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/45602-xlarge/Sony-Xperia-M2.jpg",
    "weight": "5.22 oz",
    "size": "4.8 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z3",
    "name": "Sony Xperia Z3",
    "description": "The Xperia Z3 is Sony's thinnest Android flagship to date, with a profile that measures in at just 7.3 millimeters. Despite the slender build, however, the Z3 still packs some amazing hardware, including a quad-core Snapdragon 801 processor, 3GB of RAM, and a great, 20.7-megapixel camera.",
    "phonearenaRating": "85",
    "userRating": "8.59.3",
    "announceDate": "Sep  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48792-xlarge/Sony-Xperia-Z3.jpg",
    "weight": "5.36 oz",
    "size": "5.2 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z3-compact",
    "name": "Sony Xperia Z3 Compact",
    "description": "The Sony Xperia Z3 Compact offers a 4.6-inch screen, with resolution of 720 x 1280. A quad-core 2.5GHz Snapdragon 801 CPU is under the hood, along with the Adreno 330 GPU. 2GB of RAM is inside, and a 20.7MP snapper adorn the rear of the phone. The front-facing camera weighs in at 2.2MP.",
    "phonearenaRating": "9",
    "userRating": "99.7",
    "announceDate": "Sep  3, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48799-xlarge/Sony-Xperia-Z3-Compact.jpg",
    "weight": "4.55 oz",
    "size": "4.6 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e4g",
    "name": "Sony Xperia E4g",
    "description": "Design- and specs-wise, the Xperia E4g is similar to the Xperia E4. Some of the few differences between the two devices is the slightly more powerful 1.5GHz quad-core SoC that can be found inside the Xperia E4g, an upgrade over the 1.3GHz one in the regular Xperia E4, and the LTE connectivity on board of the newcomer. The Xperia E4g also comes with a smaller display - a 4.7-inch display with a resolution of 540 x 960 pixels.",
    "phonearenaRating": "75",
    "userRating": "7.5",
    "announceDate": "Feb 24, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51804-xlarge/Sony-Xperia-E4g.jpg",
    "weight": "4.76 oz",
    "size": "4.7 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-t",
    "name": "Sony Xperia T",
    "description": "Sony Xperia T is the company's newest flagship the Android ICS-powered device. Specs-wise, the Xperia T is equipped with a large 4.6” HD BRAVIA display, which will obviously take advantage of the Mobile BRAVIA engine that enhances media for your viewing pleasure. This, however, isn't where the interesting features of this display end. Sony has also employed its WhiteMagic technology here in the Xperia T. What it does is allowing you to set the brightness of the display really high, but the extra white pixel comes at the expense of natural color representation, at least in the Xperia P. The CPU residing inside the Sony Xperia T is the trusty dual-core Snapdragon S4 with Adreno 225 graphics, so you are unlikely to feel underpowered with it. NFC is thrown into the ring here, too, for sharing media, files and mobile payments. The handset carries the new 13MP camera with \"stacked\" Exmor RS sensor, that is especially optimized for low-light photography and high dynamic range video, and goes from sleep-to-snap in an instant.",
    "phonearenaRating": "8",
    "userRating": "87.7",
    "announceDate": "Aug 29, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37750-xlarge/Sony-Xperia-T.jpg",
    "weight": "4.90 oz",
    "size": "4.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z3x",
    "name": "Sony Xperia Z3X",
    "description": "The Sony Xperia Z3X is expected to have a 6.2-inch display with 1600 x 2560 resolution. The phone will be powered by Qualcomm Snapdragon 810 SOC and 4GB of RAM. The Z3X is said to sport Sony's curved photo sensor, which is rumored to be a 2/3 inch sensor with 22.1 MP resolution.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Oct  2, 2014",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-zl",
    "name": "Sony Xperia ZL",
    "description": "If you thought Xperia Z is amazing, but could make do without the waterproof part of it, Sony's got you covered, as it introduced the Xperia ZL sibling, with an even more compact design. With its 5.18\" x 2.74\" x 0.38\", it is shorter than the Z, and a soft-touch curved back nestles it comfortably in your palm grip.\nThe microSIM and microSD slots are situated under a large flap at the back bottom, and the phone is graced with a dedicated shutter key, unlike the glassy, watertight Z.\nSpecswise it is identical - a 5\" Full HD screen with Mobile BRAVIA Engine 2, and the typical for the tech weak viewing angles, a quad-core Snapdragon S4 Pro, and a 13 MP rear cam with HDR video capabilities. The funky part here is not only the circular power/lock key on the right, but also the front-facing camera, which is situated in the lower right corner of the phone, where you are used to find one of the Android navigational keys, which here are on-screen.\nBesides the shape and size, there is a slight difference in battery capacity between the two - the ZL has a sealed 2,370 mAh unit, which is a tad bigger than the one in the Z. The long-rumored IR blaster is indeed here, with the accompanying app that allows you to use the phone as a remote control for a wide variety of TVs, home stereos and other assorted electronics around the house.",
    "phonearenaRating": "8",
    "userRating": "89.3",
    "announceDate": "Jan  7, 2013",
    "status": "Released",
    "releaseDate": "Mar  7, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39567-large/Sony-Xperia-ZL.jpg",
    "weight": "5.33 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z-ultra",
    "name": "Sony Xperia Z Ultra",
    "description": "The Japanese have not only made the thinnest 6.5mm watertight phone with the largest 6.44\" screen and fastest 2.2 GHz quad-core Snapdragon 800 processor with the Xperia Z Ultra at launch, but it also wanted to diversify its phablet functionalities beyond what is possible with Samsung's Note family, for instance. As such, they have employed a technology that allows you to write on the screen with any regular pen or pencil whose tip is more than 1mm in diameter, besides gracing it with stylus input functionality.",
    "phonearenaRating": "87",
    "userRating": "8.78.8",
    "announceDate": "Jun 25, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/41611-xlarge/Sony-Xperia-Z-Ultra.jpg",
    "weight": "7.48 oz",
    "size": "6.4 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e1",
    "name": "Sony Xperia E1",
    "description": "The Sony Xperia E1 Is a mid-range smartphone with emphasis on the music experience. The device sports a 4-in WVGA display, 1.2GHz dual core processor, 512MB of ram and 4GB of storage.",
    "phonearenaRating": "5",
    "userRating": "5",
    "announceDate": "Jan 14, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/44867-xlarge/Sony-Xperia-E1.jpg",
    "weight": "4.23 oz",
    "size": "4.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-vaio-tap-11",
    "name": "Sony Vaio Tap 11",
    "description": "The lightweight Sony Vaio Tap 11 features a 4th generation Intel Core processor, 4 GB of RAM, plus your choice of SSDs up to 512 GB of capacity. It sports a 1080x1920 pixels 11.6\" display with Triluminous technology. You also get a full USB 3.0 port, microSD slot and microHDMI port for TV hookup. Sony has managed to trim down its waistline to just 9.9 millimeters.",
    "phonearenaRating": "8",
    "userRating": "8",
    "announceDate": "Sep 10, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42889-large/Sony-Vaio-Tap-11.jpg",
    "weight": "27.2 oz",
    "size": "11.6 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-e2303",
    "name": "Sony E2303",
    "description": "The new Sony smartphone (model number E2303) is expected to feature Android 5.0 Lollipop, an octa-core, 64-bit Snapdragon 615 processor, while its 5.2-inch display to have a 720 x 1280 pixels resolution. Other features seemingly include a 12 MP rear camera, a 5 MP front-facing camera, 2 GB of RAM, and only 4 GB of internal memory.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Feb 19, 2015",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-c",
    "name": "Sony Xperia C",
    "description": "The Sony Xperia C dual SIM 5-incher with MediaTek processor. It sports a 5\" 540x960 pixels display, a quad-core MediaTek chipset, 1 GB of RAM, 4 GB of storage and microSD slot, and has an 8 MP Exmor RS sensor on the back.",
    "phonearenaRating": "8",
    "userRating": "88.7",
    "announceDate": "Jun 28, 2013",
    "status": "Released",
    "releaseDate": "Jul  1, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/41748-large/Sony-Xperia-C.jpg",
    "weight": "5.40 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-tl",
    "name": "Sony Xperia TL",
    "description": "This is the LTE capable version of the Sony Xperia T whic is the company's newest flagship the Android ICS-powered device. Specs-wise, the Xperia T is equipped with a large 4.6” HD BRAVIA display, which will obviously take advantage of the Mobile BRAVIA engine that enhances media for your viewing pleasure. This, however, isn't where the interesting features of this display end. Sony has also employed its WhiteMagic technology here in the Xperia T. What it does is allowing you to set the brightness of the display really high, but the extra white pixel comes at the expense of natural color representation, at least in the Xperia P. NFC is thrown into the ring here, too, for sharing media, files and mobile payments.",
    "phonearenaRating": "8",
    "userRating": "89.3",
    "announceDate": "Oct  1, 2012",
    "status": "Released",
    "releaseDate": "Nov  2, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38390-xlarge/Sony-Xperia-TL.jpg",
    "weight": "5.22 oz",
    "size": "4.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-sp",
    "name": "Sony Xperia SP",
    "description": "The Sony Xperia SP sports aluminum frame and Sony's NXT design cues, with an illuminated transparent strip at the bottom, which pulsates in different colors, depending on the notification. Still, we get this year's power/lock key, and a variety of different colors.\nIt also sports a generous 4.6\" 720p display, 1.7 GHz Snapdragon S4 Pro, 1GB of RAM, and an 8 MP Exmor RS camera sensor to round up a good mid-range package. It is still amazing that now we are calling such a handset mid-range, but that's the law of the land in the Android world. The handset is likely destined for the European and Asian markets with price tag rumors hovering around the EUR 300 mark SIM-free.",
    "phonearenaRating": "8",
    "userRating": "89.5",
    "announceDate": "Mar 18, 2013",
    "status": "Released",
    "releaseDate": "Apr 30, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40180-xlarge/Sony-Xperia-SP.jpg",
    "weight": "5.47 oz",
    "size": "4.6 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-c3",
    "name": "Sony Xperia C3",
    "description": "The Xperia C3 is a mid-ranger with a quad-core Snapdragon SoC, ticking at 1.2GHz, 1GB of RAM, 8 gigabytes of internal storage, and a microSD slot. The 5.5-inch Triluminos display sports a resolution of 720 x 1280 pixels, and this results in a mediocre pixel density of 267 ppi. The phone has 8MP Sony Exmor RS sensor, on the back, which comes with auto focus and is capable of shooting 1080p videos. The front-facing snapper of the Xperia C3 is a 5MP one.  Users can snap two SIM cards in their device, whereas a 2,500mAh battery takes care of the power department. The smartphone will be running Android 4.4 KitKat out of the box.",
    "phonearenaRating": "873",
    "userRating": "8.7",
    "announceDate": "Jul  8, 2014",
    "status": "Released",
    "releaseDate": "Aug 20, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47858-xlarge/Sony-Xperia-C3.jpg",
    "weight": "5.28 oz",
    "size": "5.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-m",
    "name": "Sony Xperia M",
    "description": "The Sony Xperia M is a mid-range device running on Android 4.1. It comes with a 4\" 480 x 854 pixels TFT display, dual-core Qualcomm Snapdragon S4 Pro processor at 1GHz, 1GB RAM, 5MP rear camera. It is available in four color versions - Black, White, Purple and Lime.",
    "phonearenaRating": "73",
    "userRating": "7.38.9",
    "announceDate": "Jun  4, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40970-xlarge/Sony-Xperia-M.jpg",
    "weight": "4.06 oz",
    "size": "4.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-e-dual",
    "name": "Sony Xperia E dual",
    "description": "Sony Xperia E dual is an affordable and compact dual SIM handset. The stand-out feature Sony wants us to note in the Xperia E is HD Voice, the purpose of which is to noticeably boost the sound quality of phone calls. When it comes to specs, the Xperia E will deliver a mid-range experience with its 3.5\" HVGA touchscreen and 1GHz processor. Let's hope that Jelly Bean's Project Butter will help get rid of the lag. Sony also claims that we'll be surprised by the battery life of the device. The 1500 mAh battery will benefit from a special extended stand-by mode designed to increase overall battery life. Basically, when the phone's sleeping, it will disable all functions except for calling and messaging, and once you wake it up, all functions will be restored to their normal state. Of course, users will be able to enjoy Sony's \"Walkman\" music experience, as well as the xLOUD sound technology, which works really well in most Sony smartphones.",
    "phonearenaRating": "7",
    "userRating": "7",
    "announceDate": "Dec  5, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39336-xlarge/Sony-Xperia-E-dual.jpg",
    "weight": "4.08 oz",
    "size": "3.5 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-c670x",
    "name": "Sony Xperia C670X",
    "description": "Sony Xperia C670X is rumored to launch this summer, and latest we are hearing on the grapevine is that it will be a truly impressive 4.8-inch 1080p device featuring a Snapdragon 600 chip. That is the same chip powering the HTC One and expected to be in some versions of the Samsung Galaxy S IV. Judging from the similar model number (the Xperia Z is C660X), the upcoming Xperia C670X might end up looking similar save for the slightly smaller display. On the inside, it’s noticeably more muscular, though. The quad-core processor clock is bumped up to 1.8GHz, and it features Adreno 320 graphics. The C670X is also said to come with 2GB RAM, 32GB internal storage and a 13MP Exmor RS camera.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  1, 2013",
    "status": "Not officially announced",
    "releaseDate": "2013                 (Unofficial)",
    "weight": "",
    "size": ""
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z2a",
    "name": "Sony Xperia Z2a",
    "description": "The Sony Xperia Z2a is a smaller version of the Xperia Z2 flagship with plastic rear design, but still water and dust resistant. The phone comes with a 5-inch 1080 x 1920 IPS display, Snapdragon 801 SOC, 3GB RAM and 20.7 megapixels rear camera. The Xperia Z2a is powered by 3000mAh battery and runs Android KitKat. Its availability is expected to be limited to Asian markets only.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jun 20, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47625-large/Sony-Xperia-Z2a.jpg",
    "weight": "5.75 oz",
    "size": "5.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-t2-ultra",
    "name": "Sony Xperia T2 Ultra",
    "description": "The Sony Xperia T2 Ultra has a massive 6-inch Triluminos screen, with a pixel resolution of 720x1280. The thin, 7.6mm phablet is powered by a quad-core, 1.4GHz Qualcomm Snapdragon 400 processor, 1GB of RAM and 8GB of microSD-expandable (up to 32GB extra) native storage.",
    "phonearenaRating": "88",
    "userRating": "8.89.1",
    "announceDate": "Jan 14, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/44868-xlarge/Sony-Xperia-T2-Ultra.jpg",
    "weight": "6.07 oz",
    "size": "6.0 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z1-compact",
    "name": "Sony Xperia Z1 Compact",
    "description": "All the great things we were hearing about the mini version of the Xperia Z1 heading for the international markets, turned out true. Dubbed xperia Z1 Compact, it is much, much smaller than the Z1, as it carries a 4.3\" 720p display, but keeps the same outstanding set of specs, most importantly the same 20 MP camera module with Sony's G Lens set.",
    "phonearenaRating": "9",
    "userRating": "99.1",
    "announceDate": "Jan  6, 2014",
    "status": "Released",
    "releaseDate": "Jan 24, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/44682-xlarge/Sony-Xperia-Z1-Compact.jpg",
    "weight": "4.83 oz",
    "size": "4.3 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-tablet-z",
    "name": "Sony Xperia Tablet Z",
    "description": "The big news about Sony's Xperia Z Android tablet is not that it sports a 1920x1200 pixels display and quad-core processor - after all, we had the iPad 3/4 and Nexus 10 before it - but that the Full HD resolution screen is crammed into an extremely thin 6.9mm waterproof chassis, with stellar design to boot. It is also the first Xperia slate to feature the signature power button design as a new design hallmark of Sony's Xperia line.",
    "phonearenaRating": "9",
    "userRating": "99.1",
    "announceDate": "Jan 20, 2013",
    "status": "Released",
    "releaseDate": "Apr  8, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39657-large/Sony-Xperia-Tablet-Z.jpg",
    "weight": "17.46 oz",
    "size": "10.1 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-m2-aqua",
    "name": "Sony Xperia M2 Aqua",
    "description": "The Xperia M2 Aqua seems to package the best of Sony's Xperia apps and experience in an affordable device, but it might be underpowered to handle it all. The phone features 4.8-inch qHD display (540x960 resolution at a lowly 230 ppi pixel density), the so-so Snapdragon 400 processor with Adreno 305 graphics and 1GB RAM. There is an 8 megapixels camera with HDR on the back, as well as a humble 1.1MP front-facing camera, and mono speakers.",
    "phonearenaRating": "933",
    "userRating": "9.3",
    "announceDate": "Aug 19, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/48603-xlarge/Sony-Xperia-M2-Aqua.jpg",
    "weight": "5.26 oz",
    "size": "4.8 inches"
}, {
    "symbol": "SNE",
    "company": "Sony",
    "codename": "sony-xperia-z4-tablet",
    "name": "Sony Xperia Z4 Tablet",
    "description": "The Sony Xperia Z4 tablet has 10.1-inch QHD display and is IP68 certified. Its other features include 64-bit octa-core processor, 32GB of internal storage, 8 megapixels main camera, 5 megapixels front shooter and supports LTE. The tablet is powered by 6000mah battery and runs Android.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  2, 2015",
    "status": "Announced",
    "releaseDate": "June 2015",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51876-xlarge/Sony-Xperia-Z4-Tablet.jpg",
    "weight": "13.86 oz",
    "size": "10.1 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-porsche-design-p'9983",
    "name": "BlackBerry Porsche Design P'9983",
    "description": "The Porsche Design P'9983 is the first 'Berry handset powered by BlackBerry 10.3. The phone offers a 3.1 inch SuperAMOLED screen with resolution of 720 x 720. Under the hood is a dual-core 1.5GHz Snapdragon S4 MSM8960 processor. 2GB of RAM is on board with 64GB of native storage and a 128GB capacity microSD slot. Back and front facing cameras weigh in at 8MP and 2MP, respectively. Powering the device is a 2100mAh battery. The phone comes with Bluetooth and NFC connectivity.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Oct 17, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49738-large/BlackBerry-Porsche-Design-P9983.jpg",
    "weight": "4.94 oz",
    "size": "3.1 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9790",
    "name": "BlackBerry Bold 9790",
    "description": "The BlackBerry Bold 9790 is running BlackBerry OS 7 and sports a 2.45-inch touchscreen display, 1GHz processor, 768MB of RAM, 5-megapixel camera,Wi-Fi, GPS, 8GB internal memory and NFC chip.",
    "phonearenaRating": "7",
    "userRating": "76.4",
    "announceDate": "Nov 15, 2011",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/33283-xlarge/BlackBerry-Bold-9790.jpg",
    "weight": "3.77 oz",
    "size": "2.5 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9650",
    "name": "BlackBerry Bold 9650",
    "description": "The BlackBerry Bold 9650  has features such as a 3.2-megapixel camera, GPRS/UMTS, 1xEVDO/3G, quad-band GSM connectivity, 2.4” TFT LCD display with a resolution of 480x360 & support for 65k colors, and Bluetooth.",
    "phonearenaRating": "85",
    "userRating": "8.57.9",
    "announceDate": "Apr 26, 2010",
    "status": "Released",
    "releaseDate": "May 16, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/20857-large/BlackBerry-Bold-9650.jpg",
    "weight": "4.80 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-classic",
    "name": "BlackBerry Classic",
    "description": "The BlackBerry Classic is equipped with a 3.5 inch glass with resolution of 720 x 720. This works out to a pixel density of 291 ppi. A dual-core 1.5GHz Snapdragon MSM8960 processor is under the hood with 2GB of RAM. 16GB of native storage is on board, and a 128GB microSD slot is included for those seeking additional memory. Back and front-facing cameras weigh in at 8MP and 2MP respectively. A 2515 mAh battery powers the device.",
    "phonearenaRating": "65",
    "userRating": "6.56.7",
    "announceDate": "Feb 25, 2014",
    "status": "Released",
    "releaseDate": "Dec 17, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/50726-large/BlackBerry-Classic.jpg",
    "weight": "6.28 oz",
    "size": "3.5 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9350",
    "name": "BlackBerry Curve 9350",
    "description": "RIM BlackBerry Curve 9350 is a CDMA smartphone running BlackBerry OS7 powered by an 800MHz processor. It features a 2.44\" display, 5MP camera, Wi-Fi, GPS and microSDHC card slot.",
    "phonearenaRating": "6",
    "userRating": "62",
    "announceDate": "Aug 23, 2011",
    "status": "Released",
    "releaseDate": "Oct  2, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30685-xlarge/BlackBerry-Curve-9350.jpg",
    "weight": "3.49 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-q5",
    "name": "BlackBerry Q5",
    "description": "The BlackBerry Q5 is an affordable BlackBerry 10 QWERTY smartphone. It features a QWERTY keyboard, 3.1\" touchscreen and is offered in 4 colours - black, white, red, pink. Details regarding the hardware specs of the BlackBerry Q5 are scarce at the current moment.",
    "phonearenaRating": "7",
    "userRating": "78.1",
    "announceDate": "May 15, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40895-large/BlackBerry-Q5.jpg",
    "weight": "4.23 oz",
    "size": "3.1 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9900",
    "name": "BlackBerry Bold 9900",
    "description": "BlackBerry Bold 9900 comes with a 2.8-inch capacitive touch screen and a magnificent resolution for its size - 640x480. It is a quad-band GSM/GPRS/EDGE handset, and also supports a tri-band HSPA. This device also sports a 5MP camera, 768MB of RAM and a 8GB build-in memory. It is set to launch with BlackBerry OS 7 and NFC support.",
    "phonearenaRating": "7",
    "userRating": "78.6",
    "announceDate": "May  2, 2011",
    "status": "Released",
    "releaseDate": "Aug 11, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/28482-xlarge/BlackBerry-Bold-9900.jpg",
    "weight": "4.59 oz",
    "size": "2.8 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-9720",
    "name": "BlackBerry 9720",
    "description": "The BlackBerry 9720 is a brand new device, but it runs on the dated BlackBerry 7 operating system. In exchange for that shortcoming, it comes at an affordable price and features BlackBerry’s signature full QWERTY keyboard. Other specs include a 2.8-inch 320 x 480 pixel display, 800MHz processor with 512MB RAM, and a 1,450mAh battery with the pretty average 7 hours of talk time.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Aug 14, 2013",
    "status": "Released",
    "releaseDate": "Aug  1, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42456-large/BlackBerry-9720.jpg",
    "weight": "4.23 oz",
    "size": "2.8 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9310",
    "name": "BlackBerry Curve 9310",
    "description": "BlackBerry Curve 9310 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
    "phonearenaRating": "5",
    "userRating": "5",
    "announceDate": "Jun 27, 2012",
    "status": "Released",
    "releaseDate": "Jul 12, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/37146-xlarge/BlackBerry-Curve-9310.jpg",
    "weight": "3.66 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-z3",
    "name": "BlackBerry Z3",
    "description": "The BlackBerry Z3 is an all-touch handset with a 5-inch 540x960 display, dual-core 1.2GHz CPU, 1.5GB RAM, 5MP rear camera and 1.1MP front camera, 8GB of storage and a generous 2500mAh battery. It runs BlackBerry OS 10.",
    "phonearenaRating": "93",
    "userRating": "9",
    "announceDate": "Feb 25, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47079-large/BlackBerry-Z3.jpg",
    "weight": "5.78 oz",
    "size": "5.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-z20",
    "name": "BlackBerry Z20",
    "description": "The BlackBerry Z20 aka RIO is said to sport a 5-inch 720p screen, 8-megapixel camera with flash, 2-megapixel front facing one and LTE connectivity. The processing is done via a Qualcomm Snapdragon S4 MSM8960 dual-core chip clocked at 1.5GHz and 2GB of RAM.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Dec 30, 2014",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-3g-9330",
    "name": "BlackBerry Curve 3G 9330",
    "description": "RIM BlackBerry Curve 3G 9330 is the CDMA version of RIM BlackBerry Curve 3G 9300. It comes with a QVGA display, 2MP camera, GPS and microSDHC card slot.",
    "phonearenaRating": "75",
    "userRating": "7.56.1",
    "announceDate": "Sep 14, 2010",
    "status": "Released",
    "releaseDate": "Sep 16, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/22440-large/BlackBerry-Curve-3G-9330.jpg",
    "weight": "3.70 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9370",
    "name": "BlackBerry Curve 9370",
    "description": "RIM BlackBerry Curve 9370 is a world phone with dual-mode CDMA and GSM connectivity. Features include 2.44 inch display with resolution of 480x360, GPS and Wi-Fi are both aboard the handsets, 5MP camera with flash and video capture. Of course, the BlackBerry Curve 9370 runs the new BlackBerry 7 OS which includes RIM's second generation WebKit browser that eats up JavaScript and renders pages 40% faster than the browser on BlackBerry 6 OS.",
    "phonearenaRating": "55",
    "userRating": "5.5",
    "announceDate": "Aug 23, 2011",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30678-xlarge/BlackBerry-Curve-9370.jpg",
    "weight": "3.49 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-style-9670",
    "name": "BlackBerry Style 9670",
    "description": "The RIM BlackBerry Style 9670 handset is no doubt a departure from the usual portrait QWERTY handsets we've been accustomed to seeing, but it still manages to retain some elements that made RIM's portfolio so successful. The BlackBerry 9670 features CDMA connectivity, full QWERTY keyboard, 5-megapixel camera, Wi-Fi, 360 x 400 internal display, track pad and microSD slot which is all wrapped in a metallic casing.",
    "phonearenaRating": "75",
    "userRating": "7.58.6",
    "announceDate": "Oct 18, 2010",
    "status": "Released",
    "releaseDate": "Oct 31, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/22869-large/BlackBerry-Style-9670.jpg",
    "weight": "4.62 oz",
    "size": "360 x  400 pixels"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9930",
    "name": "BlackBerry Bold 9930",
    "description": "BlackBerry Bold 9930 is a CDMA/GSM hybrid with a 2.8-inch capacitive touch screen and a 1.2 Ghz processor. The device also sports a 5MP camera, 768MB of RAM and a 8GB build-in memory. It is set to launch with BlackBerry OS 7 and NFC support.",
    "phonearenaRating": "8",
    "userRating": "86.6",
    "announceDate": "May  2, 2011",
    "status": "Released",
    "releaseDate": "Aug 15, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/28486-xlarge/BlackBerry-Bold-9930.jpg",
    "weight": "4.59 oz",
    "size": "2.8 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-z10",
    "name": "BlackBerry Z10",
    "description": "The Z10 is a fully touchscreen BB10 device sporting modern specs, with cool patterned soft-touch material on the back. The screen is 4.2\" LCD with 1280 x 768 pixels, making for a pixel density of 356 pixels per inch. A 1.5 GHz dual-core processor and 2 GB of RAM are the power under the hood, and there are 16 GB of internal storage, as well as the all-important microSD card slot. \nYou will need all the RAM, because BB10 is a true multitasking system, like Android, so everything remains how you left it, or moves on under the hood, but is available at all times.",
    "phonearenaRating": "7",
    "userRating": "79.3",
    "announceDate": "Jan 30, 2013",
    "status": "Released",
    "releaseDate": "Jan 31, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39683-xlarge/BlackBerry-Z10.jpg",
    "weight": "4.85 oz",
    "size": "4.2 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-porsche-design-p'9981",
    "name": "BlackBerry Porsche Design P'9981",
    "description": "Porsche Design P'9981 is a smartphone from BlackBerry. The phone with the futuristic QWERTY keyboard was formerly known as the BlackBerry Knight. The handset will be available from Porsche Design stores and there is speculation that the price tag will be a very Porsche-like $2,000.\nSo what are you getting for that stack of 20 C notes? The device offers solid construction, for one thing with a forged stainless steel frame, leather back, and a sculpted QWERTY keyboard. The model is equipped with a exclusive Porsche Design UI and a Wikitude World Browser augmented reality app. Each unit of the P'9981 gets a premium PIN that allows the user of the device to find another P'9981 user in a crowd.\nOther specs include a single-core 1.2GHz processor, HD video capture and 8GB of native storage that can be pumped up to 40GB using a microSD card. The phone is NFC enabled and has BlackBerry 7 OS on board. That means the phone has the second-generation WebKit browser and includes the fast and smooth liquid graphics..",
    "phonearenaRating": "21",
    "userRating": "2",
    "announceDate": "Oct 27, 2011",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/32114-large/BlackBerry-Porsche-Design-P9981.jpg",
    "weight": "5.47 oz",
    "size": "2.8 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9780",
    "name": "BlackBerry Bold 9780",
    "description": "RIM BlackBerry Bold 9780 offers many of the same specs seen on the 9700 such as the 2.44 inch screen with resolution of 480x360 pixels, and a 624MHz processor. The changes include an upgrade to a 5MP camera and a doubling of RAM to 512MB, the new BlackBerry 6 OS and the companion WebKit browser, both delivering major multimedia improvements to Bold owners ready to move up to the new model.",
    "phonearenaRating": "85",
    "userRating": "8.58.3",
    "announceDate": "Oct 27, 2010",
    "status": "Released",
    "releaseDate": "Nov 14, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/23146-large/BlackBerry-Bold-9780.jpg",
    "weight": "4.30 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-z30",
    "name": "BlackBerry Z30",
    "description": "The BlackBerry Z30 includes a 5-inch 720p (295 ppi) AMOLED display, the largest of any BB phone, and also the now aging aged Snapdragon S4 Pro with the four CPUs running at 1.7GHz. Blackberry is yet to shed light on whether we're talking about a dual-core or quad-core, though the less potent version seems likely. In terms of memory, you'll find 2GB RAM, with just 16GB of internal storage, though you can expand that via a microSD card. BlackBerry claims that the battery on the Z30, at 2880mAh, coupled with software optimizations, offers 50% more battery life than its current competitors, though manufactures have a pretty shady track record when it comes to this particular bit of hardware, and its actual capabilities.\nTurning to the camera on the Z30, an increasingly relevant component of the entire package a smartphone offers lately, we're welcomed by a 8MP rear camera with Auto Focus, 5x digital zoom and a an LED flash. The large five element lens with an aperture of f/2.2 mean that the unit will capture a lot of light, resulting in great shots. The snapper, as is to be expected, is capable of 1080p video capture, and comes with what BB chose to call “Time Shift” – a feature that basically allows you to choose and adjust faces from several snaps, so say goodbye to ill-timed shots.\nIn terms of connectivity and extras, the Z30 is anything but lacking – you get GPS, 4G LTE connectivity and Wi-Fi, of course, but also Bluetooth 4.0 LE (low energy), NFC, and the rather nice perk that is a microHDMI port.",
    "phonearenaRating": "75",
    "userRating": "7.59.7",
    "announceDate": "Sep 18, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42902-xlarge/BlackBerry-Z30.jpg",
    "weight": "6.00 oz",
    "size": "5.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-passport",
    "name": "BlackBerry Passport",
    "description": "The Passport comes with a 4.5-inch square touch display with a 1440 x 1440 resolution and 453 PPI pixel density. Thanks to the integration of a touch-sensitive panel inside the hardware QWERTY keyboard below the display, your fingers almost never get in the way of reading or otherwise interacting with on-screen content. The Passport's hardware brawn is supplied by a 2.2GHz Snapdragon 801 quad-core processor and a spacey 3GB of RAM along with 32GB of expandable internal storage. Running BB OS 10.3, the productive smartphone is powered by a huge 3540 mAh battery, which BlackBerry said lasts 30 hours. Although the device ships with a 13MP camera with optical image stabilization, and a powerful processor, 4K video recording isn't being advertised anywhere, but it is said that the feature will come in an update.",
    "phonearenaRating": "75",
    "userRating": "7.58.6",
    "announceDate": "Jul 29, 2014",
    "status": "Released",
    "releaseDate": "Sep 24, 2014",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49345-xlarge/BlackBerry-Passport.jpg",
    "weight": "6.91 oz",
    "size": "4.5 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-torch-9860",
    "name": "BlackBerry Torch 9860",
    "description": "RIM BlackBerry Torch 9860 is an all-touch smartphone featuring the biggest screen on a BlackBerry to date - is a 3.7” WVGA (480 x 800) capacitive touchscreen. It features 1.2GHz processor, 5-megapixel camera, 720p video recoding, 8GB internal memory, microSD card slot, digital compass, 1230 mAh battery, 3G mobile hotspot functionality, Wi-Fi, accelerometer, and all this powered by BlackBerry OS 7. It is a quad-band GSM and tri-band UMTS world phone, with alternative variant featuring T-Mobile AWS 3G band.",
    "phonearenaRating": "75",
    "userRating": "7.59",
    "announceDate": "Aug  3, 2011",
    "status": "Released",
    "releaseDate": "Nov  6, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30265-large/BlackBerry-Torch-9860.jpg",
    "weight": "4.76 oz",
    "size": "3.7 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-playbook-3g+",
    "name": "BlackBerry PlayBook 3G+",
    "description": "This device appears to be a 3G enabled version of the QNX based BlackBerry PlayBook tablet, simply dubbed as the 3G+ BlackBerry PlayBook. Rather than calling it a 4G tablet outright, the attached “3G+” name is on there because the leaked slides mentions HSPA+ connectivity as its biggest differentiator with the previous model, as opposed to being a 4G LTE equipped model.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jan 27, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/34553-xlarge/BlackBerry-PlayBook-3G.jpg",
    "weight": "14.99 oz",
    "size": "7.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9220",
    "name": "BlackBerry Curve 9220",
    "description": "RIM BlackBerry Curve 9220 is a candybar phone with a 2.44 inch display with resolution of 320x240, Wi-Fi, 512MB of RAM, Bluetooth and runs the latest version of the OS. BlackBerry 7.1 OS includes RIM's second generation WebKit browser that eats up JavaScript and renders pages 40% faster than the browser on BlackBerry 6 OS.",
    "phonearenaRating": "71",
    "userRating": "7",
    "announceDate": "Apr 18, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36228-xlarge/BlackBerry-Curve-9220.jpg",
    "weight": "3.60 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-playbook",
    "name": "BlackBerry PlayBook",
    "description": "RIM BlackBerry PlayBook is introduced as the first \"professional tablet\" keeping with the BlackBerry's heavy usage in the business world. The specs are hot enough to interest both consumers and business users. The PlayBook features a 7 inch capacitive LCD display with resolution of 1024 x 600 pixels. Instead of the new BlackBerry 6 OS, a new tablet version of the BlackBerry software devised by the recently acquired QNX is running the show. The tablet will have some power under the hood with a 1GHz dual-core processor and 1GB of RAM on board. There are two cameras. The front facing shooter is 3MP with a 5MP on back. The WebKit browser will allow for HTML-5 and Adobe Flash Player 10.1.",
    "phonearenaRating": "7",
    "userRating": "7",
    "announceDate": "Sep 27, 2010",
    "status": "Released",
    "releaseDate": "Apr 19, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/22899-xlarge/BlackBerry-PlayBook.jpg",
    "weight": "14.11 oz",
    "size": "7.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9380",
    "name": "BlackBerry Curve 9380",
    "description": "BlackBerry Curve 9380 is the first ever Curve with a capacitive touch display. The handset features a 3.2\" display with 360x480 pixels, an 800MHz processor and a 5MP camera with flash and VGA video recording. Of course, onboard are BBM and all the usual BlackBerry software security features, that have made RIM's devices a favorite for enterprises and government agencies.",
    "phonearenaRating": "65",
    "userRating": "6.5",
    "announceDate": "Nov 15, 2011",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/33279-xlarge/BlackBerry-Curve-9380.jpg",
    "weight": "3.46 oz",
    "size": "3.2 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9320",
    "name": "BlackBerry Curve 9320",
    "description": "BlackBerry Curve 9320 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
    "phonearenaRating": "679",
    "userRating": "6.7",
    "announceDate": "May  9, 2012",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36223-xlarge/BlackBerry-Curve-9320.jpg",
    "weight": "3.63 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-q10",
    "name": "BlackBerry Q10",
    "description": "With its hardware QWERTY keyboard, the BlackBerry Q10 follows in the footsteps of many legacy smartphones made by RIM. The four rows of hardware keys are situated underneath a high-resolution, 720 by 720 pixel touchscreen measuring 3.1 inches in diagonal. The back of the BlackBerry Q10 is made out of a fancy, glass-like material that is claimed to be stronger, thinner, and lighter than the plastic used in many handsets today. The company's re-imagined BlackBerry 10 operating system runs on the device.",
    "phonearenaRating": "7",
    "userRating": "79.8",
    "announceDate": "Jan 30, 2013",
    "status": "Released",
    "releaseDate": "Apr 30, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/43940-xlarge/BlackBerry-Q10.jpg",
    "weight": "4.90 oz",
    "size": "3.1 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-3g",
    "name": "BlackBerry Curve 3G",
    "description": "RIM BlackBerry Curve 3G is an addition to the popular BlackBerry Curve series of smartphones. As the name suggests the BlackBerry Curve 3G supports 3G (HSDPA) networks around the world. Other features include 2MP camera, Wi-Fi, GPS, microSD slot for memory and compatibility with the new BlackBerry 6 OS.",
    "phonearenaRating": "7210",
    "userRating": "7.2",
    "announceDate": "Aug  9, 2010",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/21918-large/BlackBerry-Curve-3G.jpg",
    "weight": "3.70 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-torch-9850",
    "name": "BlackBerry Torch 9850",
    "description": "RIM BlackBerry Torch 9850 is an all-touch smartphone featuring the biggest screen on a BlackBerry to date -  a 3.7” WVGA (480 x 800) capacitive touchscreen. It it features 1.2GHz processor, 5-megapixel camera, 720p video recoding, 8GB internal memory, microSD card slot, digital compass, 1230 mAh battery, 3G mobile hotspot functionality, Wi-Fi, accelerometer, and all this powered by BlackBerry OS 7. It is CDMA phone with quad-band GSM and European UMTS (2100 MHz).",
    "phonearenaRating": "75",
    "userRating": "7.58",
    "announceDate": "Aug  3, 2011",
    "status": "Released",
    "releaseDate": "Aug 21, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30270-xlarge/BlackBerry-Torch-9850.jpg",
    "weight": "4.76 oz",
    "size": "3.7 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-torch-9810",
    "name": "BlackBerry Torch 9810",
    "description": "RIM BlackBerry Torch 9810 happens to have a clear cut design similarity with the original handset. However, looking past the surface and deeper into its hardware, there's something beating much faster under the hood that's going to supply the handset some much needed processing power. It is packing on a serious 1.2GHz processor with hardware acceleration to really make it tangle with the other big guns in the industry. Moreover, it sports the same size 3.2” touchscreen but now with improved VGA resolution, 8GB of internal storage, and 768MB RAM. Other features include GPS, 5-megapixel camera with flash and HD video, Bluetooth 2.1, 1270 mAh battery, magnetometer, and an accelerometer.",
    "phonearenaRating": "65",
    "userRating": "6.5",
    "announceDate": "Aug  3, 2011",
    "status": "Released",
    "releaseDate": "Aug 11, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30293-large/BlackBerry-Torch-9810.jpg",
    "weight": "5.68 oz",
    "size": "3.2 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-leap",
    "name": "BlackBerry Leap",
    "description": "The BlackBerry Leap sports the fairly quaint Snapdragon S4 Plus system chip with 2GB of RAM and 16 gigs of internal storage. It's the battery life that the company touts as one of the hallmark features of the new phone, though, as it has a 2800 mAh battery pack. With all the sleek newly unveiled devices, though, the Leap strikes an impression of being quite thick with 9.5mm of thickness and a weight of 170g. There is both a rear and front-facing camera: the rear, main one, has an 8-megapixel sensor.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  3, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52104-large/BlackBerry-Leap.jpg",
    "weight": "6 oz",
    "size": "5.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-4g-playbook",
    "name": "BlackBerry 4G PlayBook",
    "description": "RIM BlackBerry 4G PlayBook is the LTE enabled version of the BlackBerry PlayBook which is introduced as the first \"professional tablet\" keeping with the BlackBerry's heavy usage in the business world. The specs are hot enough to interest both consumers and business users. The PlayBook features a 7 inch capacitive LCD display with resolution of 1024 x 600 pixels. Instead of the new BlackBerry 6 OS, a new tablet version of the BlackBerry software devised by the QNX is running the show. The tablet will have some power under the hood with a 1.5GHz dual-core processor and 1GB of RAM on board. There are two cameras. The front facing shooter is 3MP with a 5MP on back. The WebKit browser will allow for HTML-5 and Adobe Flash Player 10.1.",
    "phonearenaRating": "7",
    "userRating": "710",
    "announceDate": "Jan  6, 2011",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/26184-xlarge/BlackBerry-4G-PlayBook.jpg",
    "weight": "14.11 oz",
    "size": "7.0 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-3g-t-mobile",
    "name": "BlackBerry Curve 3G T-Mobile",
    "description": "RIM BlackBerry Curve 3G is an addition to the popular BlackBerry Curve series of smartphones. This is the version which has 3G support compatible with T-Mobile USA. Specs wise the phone offers nothing spectacular, 2MP camera, Wi-Fi, GPS, microSD slot for memory and compatibility with the new BlackBerry 6 OS.",
    "phonearenaRating": "75",
    "userRating": "7.5",
    "announceDate": "Aug  9, 2010",
    "status": "Released",
    "releaseDate": "Sep  8, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/21920-large/BlackBerry-Curve-3G-T-Mobile.jpg",
    "weight": "3.70 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9360",
    "name": "BlackBerry Curve 9360",
    "description": "RIM BlackBerry Curve 9360 comes equipped with a 2.44\" 480 x 360 display, 5-megapixel camera, microSDHC card slot, GPS, Wi-Fi and Bluetooth 2.1. All this is powered by BlackBerry OS7 with an 800MHz processor running the show.",
    "phonearenaRating": "8",
    "userRating": "87.3",
    "announceDate": "Aug 23, 2011",
    "status": "Released",
    "releaseDate": "Sep 28, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/30687-xlarge/BlackBerry-Curve-9360.jpg",
    "weight": "3.49 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-curve-9315",
    "name": "BlackBerry Curve 9315",
    "description": "BlackBerry Curve 9315 is a device for first time smartphone users and as such, specs-wise, it is nothing worth bragging about. It features a 2.44 QVGA display (not a touchscreen), GPS, Bluetooth, Wi-Fi, microSD card slot, 512MB RAM, the typical Curve keyboard and a 3.2-megapixel extended depth of field camera.",
    "phonearenaRating": "5",
    "userRating": "56",
    "announceDate": "Jan  3, 2013",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/39521-xlarge/BlackBerry-Curve-9315.jpg",
    "weight": "3.66 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-bold-9780-t-mobile",
    "name": "BlackBerry Bold 9780 T-Mobile",
    "description": "RIM BlackBerry Bold 9780 for T-Mobile offers many of the same specs seen on the 9700 such as the 2.44 inch screen with resolution of 480x360 pixels, and a 624MHz processor. The changes include an upgrade to a 5MP camera and a doubling of RAM to 512MB, the new BlackBerry 6 OS and the companion WebKit browser, both delivering major multimedia improvements to Bold owners ready to move up to the new model.",
    "phonearenaRating": "85",
    "userRating": "8.57.5",
    "announceDate": "Oct 27, 2010",
    "status": "Released",
    "releaseDate": "Nov 17, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/23149-large/BlackBerry-Bold-9780-T-Mobile.jpg",
    "weight": "4.30 oz",
    "size": "2.4 inches"
}, {
    "company": "Blackberry",
    "codename": "blackberry-r10",
    "name": "BlackBerry R10",
    "description": "The BlackBerry R10 is a yet unannounced device that is expected to become the third member of the BlackBerry 10 family, coming after the BlackBerry Z10 and Q10. The known specs include a QWERTY keyboard, 3.1-inch display with 720 x 720 px resolution, 5MP rear camera, front camera, 2GB of RAM, 8GB internal storage and a 1800 mAh non-removable battery.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "May 10, 2013",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/40860-large/BlackBerry-R10.jpg",
    "weight": "",
    "size": ""
}, {
    "company": "Blackberry",
    "codename": "blackberry-torch-9800",
    "name": "BlackBerry Torch 9800",
    "description": "RIM BlackBerry Torch 9800 is a phone for all those customers who wanted something of both worlds – a multi-touch screen and RIM's  renown QWERTY keyboard design. The device will feature a 3.2-inch touchscreen with a resolution of 360x480 pixels (not exactly groundbreaking stuff), 512MB RAM, 5MP camera, Wi-Fi 802.11 b/g/n and quad-band 3G. The design and hardware of the BlackBerry Torch seem great for the most part, but equally impressive should be the software that will be employed in the new smartphone. First before most we should mention the brand new web browser that will support tabs and pinch-to-zoom. RIM's acclaimed messaging/email prowess are of course present, along with much improved social networking and multimedia capabilities, which will all be part of the new BlackBerry 6 operating system that will be powering the Torch.",
    "phonearenaRating": "8",
    "userRating": "89.1",
    "announceDate": "Aug  3, 2010",
    "status": "Released",
    "releaseDate": "Aug 12, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/21867-large/BlackBerry-Torch-9800.jpg",
    "weight": "5.68 oz",
    "size": "3.2 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-8",
    "name": "Google Nexus 8",
    "description": "",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar 12, 2014",
    "status": "Not officially announced",
    "releaseDate": "July 2014                 (Unofficial)",
    "weight": "",
    "size": ""
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-9",
    "name": "Google Nexus 9",
    "description": "The HTC made Nexus 9 comes with a 8.9-inch IPS screen with 2048x1536 pixels resolution (4:3 aspect ratio), an 8-megapixel shooter with led flash, Bluetooth 4.1 connectivity and 16 or 32GB of storage. The tablet is powered by a 64bit NVIDIA tegra K1 dual-core processor clocked at 2.3GHz and 2GB of DDR3 memory. The Nexus 9 will come in 2 variations; either Wi-Fi only or Wi-Fi+LTE.",
    "phonearenaRating": "93",
    "userRating": "9.38.6",
    "announceDate": "Oct 15, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49489-xlarge/Google-Nexus-9.jpg",
    "weight": "15.38 oz",
    "size": "8.9 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-s-4g",
    "name": "Google Nexus S 4G",
    "description": "Google Nexus S 4G is the is the WiMAX capable brother of the Google Nexus S. It is not a great leap forward in the same way that the original Nexus was but rather is more like a refreshed version of the Samsung Galaxy S. It runs Google's new version of Android OS Gingerbread and it is powered by 1GHz processor. Other features include a 4-inch Super AMOLED Contour Display, which is slightly curved, 5MP camera, Near Field Communication (NFC), Wi-Fi and more.",
    "phonearenaRating": "85",
    "userRating": "8.58.3",
    "announceDate": "Mar 21, 2011",
    "status": "Released",
    "releaseDate": "May  8, 2011",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/27607-xlarge/Google-Nexus-S-4G.jpg",
    "weight": "4.60 oz",
    "size": "4.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-5",
    "name": "Google Nexus 5",
    "description": "The Nexus 5 is an affordable device packing top-shelf specs. Made in collaboration with Google and LG, the Nexus 5 runs on the newest Android 4.4 KitKat. It is a solid performer featuring a Snapdragon 800 system chip and 2GB of RAM. It is also the first Nexus to put the focus on camera performance as it comes with an 8-megapixel shooter with optical image stabilization (OIS).",
    "phonearenaRating": "95",
    "userRating": "9.59.4",
    "announceDate": "Oct 31, 2013",
    "status": "Released",
    "releaseDate": "Oct 31, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/43727-xlarge/Google-Nexus-5.jpg",
    "weight": "4.59 oz",
    "size": "5.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-10",
    "name": "Google Nexus 10",
    "description": "Google Nexus 10 is a beast of a device, with the main feature: a 2650x1600 display clocking in at 299 pixels per inch. As for the rest of the specs, the Nexus 10 will be packing Samsung's new 1.7GHz Cortex A15-based Exynos 5 chip, and quad-core Mali-T604 GPU, 2GB of RAM, NFC, a 5MP rear camera, and 1.9MP front camera. The tablet will also be running Android 4.2, just like the LG Nexus 4. One downside for some users is that the Nexus 10 will not have an SD card slot, so the storage is what it is.",
    "phonearenaRating": "9",
    "userRating": "99.3",
    "announceDate": "Oct 29, 2012",
    "status": "Released",
    "releaseDate": "Nov 13, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38613-xlarge/Google-Nexus-10.jpg",
    "weight": "21.27 oz",
    "size": "10.1 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-7",
    "name": "Google Nexus 7",
    "description": "The Google Nexus 7, manufactured by Asus, is an Android slate with 7-inch 1280x800 screen and a 1.3GHz NVIDIA Tegra 3 quad-core processor. The tablet runs Android 4.1 Jellybean.",
    "phonearenaRating": "9",
    "userRating": "99.2",
    "announceDate": "Jun 27, 2012",
    "status": "Released",
    "releaseDate": "Jul 15, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36897-large/Google-Nexus-7.jpg",
    "weight": "11.99 oz",
    "size": "7.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-6",
    "name": "Google Nexus 6",
    "description": "The Nexus 6 is powered by the Snapdragon 805 system chip, the jewel in Qualcomm’s 32-bit crown. This is the last iteration of Qualcomm’s Krait CPU core architecture, with four cores running at up to 2.65GHz, along with 3GB of RAM, and Adreno 420 graphics. The devices sports a 5.96\" AMOLED screen with 1440x2560 pixels resolution, a 13-megapixel shooter capable of capturing 4K videos, a secondary 2-megapixel unit can be found on the front alongside the two front facing speakers.",
    "phonearenaRating": "9",
    "userRating": "99.6",
    "announceDate": "Oct 15, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/49488-large/Google-Nexus-6.jpg",
    "weight": "6.49 oz",
    "size": "6.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-s",
    "name": "Google Nexus S",
    "description": "Google Nexus S is the follow-up of the Google Nexus One. It is not a great leap forward in the same way that the original Nexus was but rather is more like a refreshed version of the Samsung Galaxy S. It runs Google's new version of Android OS which is called Gingerbread and it is powered by 1GHz processor. Other features include a 4-inch Super AMOLED unique Contour Display, which is slightly curved, 5MP camera, Near Field Communication (NFC), Wi-Fi and more.\n\nThe phone is offered unlocked or with T-Mobile USA and AT&T service plans through Best Buy only, and not directly by T-Mobile or AT&T.",
    "phonearenaRating": "85",
    "userRating": "8.58.8",
    "announceDate": "Dec  7, 2010",
    "status": "Released",
    "releaseDate": "Dec 16, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/23642-large/Google-Nexus-S.jpg",
    "weight": "4.55 oz",
    "size": "4.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-7-(2013)",
    "name": "Google Nexus 7 (2013)",
    "description": "The second generation Google Nexus 7 tablet contiinues with the tradition of the first to offer great specs at cost, which ballooned the Android tablets market share, chipping away at the archrival's iPad domination. The 2013 iteration of the Nexus 7 comes with the record for a tablet 323ppi pixel density, quad-core processor, 2 GB of RAM and 5 MP camera on the back, all for the low starting price of $230, cementing its place in the tablet hall of fame.",
    "phonearenaRating": "95",
    "userRating": "9.59.3",
    "announceDate": "Jul 24, 2013",
    "status": "Released",
    "releaseDate": "Jul 26, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42118-large/Google-Nexus-7-2013.jpg",
    "weight": "10.55 oz",
    "size": "7.0 inches"
}, {
    "symbol": "GOOG",
    "company": "Google",
    "codename": "google-nexus-4",
    "name": "Google Nexus 4",
    "description": "Google Nexus 4 has a 1.5GHz quad-core Snapdragon S4 Pro with Krait CPUs (meaning this thing should be crazy fast), a 4.7-inch WXGA True HD IPS Plus (1280 x 768 pixels) display with Zerogap Touch technology and Corning Gorilla Glass 2, 2GB of RAM, an 8MP rear camera, a 1.3MP front camera, and a 2100 mAh battery rated for upwards of 15.3 hours of talk time. The device has NFC as expected, and will support wireless charging. It will run Android 4.2 Jelly Bean.",
    "phonearenaRating": "9",
    "userRating": "99.4",
    "announceDate": "Oct 29, 2012",
    "status": "Released",
    "releaseDate": "Nov 13, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/38618-xlarge/Google-Nexus-4.jpg",
    "weight": "4.90 oz",
    "size": "4.7 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-540-dual",
    "name": "Microsoft Lumia 540 Dual",
    "description": "The Nokia Lumia 540 Dual SIM comes with a 5\" display that has a resolution of 720 x 1280 pixels, making up for a pixel density of 294ppi, while a quad-core Snapdragon 200 is humming inside the phone at 1.2GHz. The SoC is paired with 1GB of RAM and has 8 gigs of native storage from the get-go. You also get a microSD card slot and up to 30GB of cloud-based storage with Microsoft's OneDrive. The Lumia 540 Dual SIM is equipped with an 8MP rear camera that comes with a LED flash and auto focus, while the front-facing shooter is a 5MP wide-angle one. The battery powering this Windows Phone trooper is a removable 2,200mAh one. Speaking of Windows Phone, the Lumia 540 is running on Windows Phone 8.1 with most recent update Lumia Denim update.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Apr 14, 2015",
    "status": "Announced",
    "releaseDate": "May 2015",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52730-xlarge/Microsoft-Lumia-540-Dual.jpg",
    "weight": "5.36 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-435",
    "name": "Microsoft Lumia 435",
    "description": "Given its entry-level status, one shouldn't expect anything noteworthy in the specs sheet of this Lumia newcomer. Powered by a dual-core Snapdragon 200 chipset ticking at up to 1.2GHz, which works in concert with 1 gigabyte of RAM, the Lumia 435 is positioned on the lower end of the smartphone table. It has a 4\" LCD display with a resolution of 480 x 800 pixels, a 2MP main camera with fixed focus, VGA selfie-shooter, 8GB of native storage, a microSD card slot, and last but not least, a 1,560mAh battery to keep the lights on.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jan 14, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51138-xlarge/Microsoft-Lumia-435.jpg",
    "weight": "4.73 oz",
    "size": "4.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-532",
    "name": "Microsoft Lumia 532",
    "description": "The Lumia 532 sports a 4\" 480x800 resolution display with 233ppi pixel density, 5-megapixel camera and 8GB of storage (expandable via a microSD card). The devices is powered by a 1.2 GHz quad-core Qualcomm Snapdragon 200 processor paired with 1GB of RAM.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jan 14, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/51146-xlarge/Microsoft-Lumia-532.jpg",
    "weight": "4.81 oz",
    "size": "4.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-1330",
    "name": "Microsoft Lumia 1330",
    "description": "The Microsoft Lumia 1330 is expected to be equiped with a 14 MP camera – quite the upgrade, compared to the Lumia 1320's 5 MP snapper. The rest of the rumored specs list a 5.7\", 720p display, a Snapdragon 400 SoC, 1 GB of RAM, and a 5 MP selfie snapper – keeping with the trend, we see.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Jan 19, 2015",
    "status": "Not officially announced",
    "releaseDate": "unknown",
    "weight": "",
    "size": ""
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-kin-two",
    "name": "Microsoft KIN TWO",
    "description": "The Microsoft KIN TWO is the more powerful brother of KIN ONE (and also the bulkier) with capacitive HVGA display, 8MP camera with HD 720p video capture and flash, as well as 8GB of storage space.",
    "phonearenaRating": "7",
    "userRating": "76.2",
    "announceDate": "Apr 12, 2010",
    "status": "Released",
    "releaseDate": "May  6, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/20719-large/Microsoft-KIN-TWO.jpg",
    "weight": "",
    "size": "3.4 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-535",
    "name": "Microsoft Lumia 535",
    "description": "The Microsoft Lumia 535 doesn’t offer high-end specs, but it’s certainly a step up from the slightly older Lumia 530. Powered by a quad-core 1.2 GHz Snapdragon 200 processor, the phone features a 5-inch IPS display with 540 x 960 pixels, HSDPA, Wi-Fi 802.11 b/g/n, Bluetooth 4.0, 1 GB of RAM, 8 GB of expandable internal memory, and a 1905 mAh battery. On the back, the Lumia 535 has a 5 MP camera with LED flash, while its front-facing shooter is the same 5 MP one that we can find on the selfie-centric Lumia 730 / 735.",
    "phonearenaRating": "7",
    "userRating": "710",
    "announceDate": "Nov 10, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/50174-xlarge/Microsoft-Lumia-535.jpg",
    "weight": "5.15 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-surface-rt",
    "name": "Microsoft Surface RT",
    "description": "The Microsoft Surface is the first Microsoft-designed tablet computer. The ARM-powered version is thinner and lighter and features a processor made by NVIDIA. It comes with Windows RT and a large 10.6\" touchscreen. The device is designed to compete mainly with tablets running mobile operating systems like Android and iOS (iPad).",
    "phonearenaRating": "85",
    "userRating": "8.5",
    "announceDate": "Jun 18, 2012",
    "status": "Released",
    "releaseDate": "Oct 26, 2012",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36762-large/Microsoft-Surface-RT.jpg",
    "weight": "24.00 oz",
    "size": "10.6 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-surface-pro-3",
    "name": "Microsoft Surface Pro 3",
    "description": "The Microsoft Surface 3 features a 12-inch display with 2160x1440 resolution and a 3:2 aspect ratio. Its body is made out of magnesium which brings down its weight to around 800 grams.The device has several hardware configurations ranging from an Intel Core i3 to an i7 processor, 4 or 8GB of RAM and the storage space starts at the reasonable 64GB and reaches all the way to 512GB. If the built-in memory is not enough, it can be expanded via the microSD port. Its other features include two 5-megapixel cameras with video 1080p capture, mini DisplayPort and Dobly stereo speakers.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "May 20, 2014",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/47163-xlarge/Microsoft-Surface-Pro-3.jpg",
    "weight": "28.16 oz",
    "size": "12.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-kin-one",
    "name": "Microsoft KIN ONE",
    "description": "The Microsoft KIN ONE has a slide-out portrait QWERTY keyboard and capacitive QVGA touchscreen, which will let you interact with the custom interface. It has a 5MP camera with flash and 4GB of internal storage space.",
    "phonearenaRating": "7",
    "userRating": "77.3",
    "announceDate": "Apr 12, 2010",
    "status": "Released",
    "releaseDate": "May  6, 2010",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/20721-large/Microsoft-KIN-ONE.jpg",
    "weight": "",
    "size": "2.6 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-surface-pro-2",
    "name": "Microsoft Surface Pro 2",
    "description": "The Surface Pro 2 has the same 10.6\" 1920x1080 pixels ClearType display like its predecessor, but this time with 46% better color accuracy and record low reflectivity, nearly identical with the sRGB color gamut coverage. That is aimed at making it a device for professionals and screen purists alike, but also to make outdoor visibility better for the average user as well.\n\nThe new Surface Pro 2 is equipped with the Haswell architecture of Intel's Core i5 processor, meaning it marks strides in battery life compared to its predecessor - 75% improvement, or between 7-10 hours, depending on the usage. The unit has also been made much quieter, though that still means you are likely to see a fan inside.",
    "phonearenaRating": "85",
    "userRating": "8.5",
    "announceDate": "Sep 23, 2013",
    "status": "Released",
    "releaseDate": "Oct 22, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42931-xlarge/Microsoft-Surface-Pro-2.jpg",
    "weight": "31.99 oz",
    "size": "10.6 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-kin-two-gsm",
    "name": "Microsoft KIN TWO GSM",
    "description": "The Microsoft KIN TWO is the more powerful brother of KIN ONE (and also the bulkier) with capacitive HVGA display, 8MP camera with HD 720p video capture and flash, as well as 8GB of storage space.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Apr 12, 2010",
    "status": "Canceled",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/20724-large/Microsoft-KIN-TWO-GSM.jpg",
    "weight": "",
    "size": ""
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-640",
    "name": "Microsoft Lumia 640",
    "description": "The Microsoft Lumia 640 features a 5-inch HD display, comes in a range of vivid colors, and runs on Windows Phone 8.1 (it's set to get upgraded to Windows 10 in the not too distant future). The Lumia 640 has all the options you'd expect from an affordable phone: more specifically, it arrives in a single- and dual-SIM versions with both a 3G model and 4G LTE version of the handset, including a dual-SIM LTE device. The handset comes in a range of colors including cyan, orange, black and white. It's also got an 8-megapixel camera with dynamic flash and auto HDR, as well as a front-facing camera with wide-angle lens. It is pre-loaded with the latest Lumia camera app update.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  2, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52064-xlarge/Microsoft-Lumia-640.jpg",
    "weight": "5.11 oz",
    "size": "5.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-430",
    "name": "Microsoft Lumia 430",
    "description": "The Microsoft Lumia 430 has \"low-end\" written all over it. The smartphone packs a 4-inch display with 480 by 800 pixels of resolution, a dual-core Snapdragon 200 SoC running at up to 1.2GHz, 1GB of RAM, and 8GB of expandable storage. The main, fixed-focus camera has just 2MP of resolution, while the front-facing cam shoots 640 by 480-pixel images. The dual SIM functionality is welcome as it enables one to use two carriers' services on one device. All in all, a modest hardware configuration, but actually decent given the phone's price point. Windows Phone is known for running well even on low-end devices, and the 1GB of RAM should suffice for all the apps available on the Windows Phone Marketplace.Speaking of software, the Microsoft Lumia 430 ships with Windows Phone 8.1 along with the Denim update.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar 20, 2015",
    "status": "Announced",
    "releaseDate": "unknown",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52379-xlarge/Microsoft-Lumia-430.jpg",
    "weight": "4.51 oz",
    "size": "4.0 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-lumia-640-xl",
    "name": "Microsoft Lumia 640 XL",
    "description": "The Microsoft Lumia 640 XL comes with a 5.7-inch display (versus a 5-inch display on the Lumia 640), and it runs on Windows Phone 8.1 with the promise to get upgraded to Windows 10. Its features include a 1.2GHz quad-core procesor, 1GB of RAM, 8GB of storage, 13-megapixel main camera and a 5-megapixel shooter on the front.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Mar  2, 2015",
    "status": "Released",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/52065-xlarge/Microsoft-Lumia-640-XL.jpg",
    "weight": "6.03 oz",
    "size": "5.7 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-surface-pro",
    "name": "Microsoft Surface Pro",
    "description": "The Microsoft Surface is the first Microsoft-designed tablet computer. The Intel-powered version is thicker and heavier than the ARM one, but comes with the much more powerful Windows 8 Pro, providing the full functionality of a PC. It has a large 10.6\", high-resolution touchscreen and powerful hardware characteristics that allow it to compete with both tablets and high-end laptops alike.",
    "phonearenaRating": "85",
    "userRating": "8.5",
    "announceDate": "Jun 18, 2012",
    "status": "Released",
    "releaseDate": "Feb  9, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/36794-large/Microsoft-Surface-Pro.jpg",
    "weight": "32.00 oz",
    "size": "10.6 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-surface-2",
    "name": "Microsoft Surface 2",
    "description": "Microsoft Surface 2 is a new tablet that comes to succeed last year's Surface RT. That's right, Microsoft is keeping Windows RT around, and so the Surface 2 will be powered by the updated Windows RT 8.1 OS.\n\nRather than treating us to some kind of a complete redesign, Microsoft is keeping all the good stuff about the Surface RT and has upgraded the device where necessary. With a slightly thinner and lighter design, the Surface 2 will also sport a much better 10.6\" screen, upping the resolution from 1366 x 768 pixels to 1920 x 1080 pixels - a much-needed improvement. Under the hood, the Surface 2 will be powered by the new Tegra 4 chipset (the Surface RT had Tegra 3). Unfortunately, Tegra 4 hasn't seen much spotlight as far as smartphones are concerned, but it's slowly and steadily grabbing chunks of market share when it comes to tablets.\n\nA nice extra that Microsoft is going to bundle with the Surface 2 is called \"Best of Skype\". Basically, new Surface 2 owners will gain access to one year of free Skype Wi-Fi hotspots, as well as one year of free international Skype calls. What's more, users will also get 200 GB of free Skydrive storage.",
    "phonearenaRating": "8",
    "userRating": "8",
    "announceDate": "Sep 23, 2013",
    "status": "Released",
    "releaseDate": "Oct 22, 2013",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/42924-xlarge/Microsoft-Surface-2.jpg",
    "weight": "23.84 oz",
    "size": "10.6 inches"
}, {
    "symbol": "MSFT",
    "company": "Microsoft",
    "codename": "microsoft-kin-one-gsm",
    "name": "Microsoft KIN ONE GSM",
    "description": "The Microsoft KIN ONE has a slide-out portrait QWERTY keyboard and capacitive QVGA touchscreen, which will let you interact with the custom interface. It has a 5MP camera with flash and 4GB of internal storage space.",
    "phonearenaRating": "",
    "userRating": "",
    "announceDate": "Apr 12, 2010",
    "status": "Canceled",
    "releaseDate": "",
    "imageUrl": "//i-cdn.phonearena.com/images/phones/20726-large/Microsoft-KIN-ONE-GSM.jpg",
    "weight": "",
    "size": ""
}]