[
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola ELECTRIFY M",
        "description": "The Motorola Electirfy M is an Android 4.0 smartphone for U.S. Cellular that sports 4.3-inch Super AMOLED Advanced display, 4G LTE, 1.5 GHz dual-core CPU, 1GB of RAM, 8-megapixel shooter with 1080p video capture and all of the connectivity features we've come to expect from an Android smartphone.",
        "phonearenaRating": "94",
        "userRating": "9",
        "announceDate": "Nov  1, 2012",
        "status": "Released",
        "releaseDate": "Nov  8, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/38838-xlarge/Motorola-ELECTRIFY-M.jpg",
        "weight": "3.92 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto G LTE",
        "description": "The Motorola Moto G LTE is the LTE version of the Moto G blockbuster. The specs of the two phones are the same - a 4.5\" 720p display, Snapdragon 400 processor, 1 GB of RAM, and a 5 MP rear camera, but, besides the LTE radio, the Moto G LTE has another upgrade - the expandable storage. Yep, we are now having a Moto G with a microSD slot, so you can add up to 32 GB more memory to the 8 GB/16 GB that you get out of the box.",
        "phonearenaRating": "833",
        "userRating": "8.3",
        "announceDate": "May 13, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/47058-xlarge/Motorola-Moto-G-LTE.jpg",
        "weight": "5.04 oz",
        "size": "4.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto E (2015)",
        "description": "The new Moto E has both LTE, and non-LTE variants. The handset is powered by a quad-core 1.2 GHz Qualcomm processor (a Snapdragon 410 on the LTE version, and a Snapdragon 200 on the 3G-only version), and comes with a 4.5-inch, 540 x 960 pixels display - thus being slightly larger than the 2014 model. Other features include a 5 MP rear camera with 720p video recording, VGA front-facing camera, 1 GB of RAM, 8 GB of expandable internal memory, and a 2390 mAh battery that's \"designed to last all day.\"",
        "phonearenaRating": "8",
        "userRating": "8",
        "announceDate": "Feb 25, 2015",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/51859-xlarge/Motorola-Moto-E-2015.jpg",
        "weight": "5.11 oz",
        "size": "4.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DEFY XT",
        "description": "The Motorola DEFY XT is a smartphone with Andrdoid 2.3, 3.7'' display, 5MP camera and a front-facing shooter, 1GHz processor, 1GB ROM / 512MB RAM, GPS and aGPS, as well as the standard features of the platform.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Aug  2, 2012",
        "status": "Released",
        "releaseDate": "Aug  3, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37468-large/Motorola-DEFY-XT.jpg",
        "weight": "4.59 oz",
        "size": "3.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID MAXX",
        "description": "Motorola DROID MAXX has a 3500 mAh battery, which is 200 mAh more than its predecessor, and the kind of capacity only phablets get equipped with nowadays, and cited for up to 48 hours of battery life. That capacity is keeping the lights on a very interesting set of specs - 5\" HD OLED display (not PenTile), 1.7 GHz homemade processor, 2 GB of RAM and 32 GB of internal memory. Exact dimensions go as follows: 137.5x71.20x8.5 mm, so pretty thin despite the giant battery, and fairly light for a 5-incher at 160 grams, or 5.6 ounces.\n\nThe \"Motorola X8 Mobile Computing System\" SoC sports 1.7 GHz dual-core application processor, 400 MHz quad-core GPU, natural language processor, and a contextual computing processor, for an octa-core concoction, claims Moto.\n\nThe 10 MP camera on the back sports the new ClearPixel technology, which applies different RGBC color filter than the traditional Bayer RGBG one, bringing in more photons at low-light scenarios thus dealing better with blur and noise, at least on theory.",
        "phonearenaRating": "85",
        "userRating": "8.59.8",
        "announceDate": "Jul 23, 2013",
        "status": "Released",
        "releaseDate": "Aug 20, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42071-xlarge/Motorola-DROID-MAXX.jpg",
        "weight": "5.89 oz",
        "size": "5.0 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto X",
        "description": "The revolutionary Moto X lets you customize every nook and cranny of the outer appearance, down to your own boot animation, and headphones to match your back cover color. Every aspect of the phone was rehashed in line with the function it performs, rather than chasing the specs-o-meter. Moto went with OLED, as it makes possible the Active Display notification function, but it is a standard RGB matrix OLED, so you still get plenty of true pixel density, \"without wasting power on pixels most people can't see\". \n\nThe X8 processor might have \"just\" two CPU cores, but it is rethought from the ground up to make the always-on environmental awareness of the phone possible with power-sipping extra processing cores. The 10 MP camera might not be in line with the 13 MP on current flagships, but is the first to utilize the Clear Pixel technology that lets it soak much more light, and so on.",
        "phonearenaRating": "85",
        "userRating": "8.59.5",
        "announceDate": "Aug  1, 2013",
        "status": "Released",
        "releaseDate": "Aug 23, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42274-xlarge/Motorola-Moto-X.jpg",
        "weight": "4.59 oz",
        "size": "4.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID RAZR MAXX",
        "description": "Motorola DROID RAZR MAXX is a slightly thicker twin of the DROID RAZR, coming with a larger battery to boost its battery life. All other specs remain the same.",
        "phonearenaRating": "85",
        "userRating": "8.58.7",
        "announceDate": "Jan  9, 2012",
        "status": "Released",
        "releaseDate": "Jan 26, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/34431-xlarge/Motorola-DROID-RAZR-MAXX.jpg",
        "weight": "5.11 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola ELECTRIFY 2",
        "description": "Motorola ELECTRIFY 2 is the follow up successor to the original ELECTRIFY from last year. Similar to Verizon’s DROID RAZR, the Motorola ELECTRIFY 2 has all the awesome specs to make it a standout leader amongst the carrier's existing crop. In fact, this beauty boasts many of the exquisite elements that we find with Verizon’s DROID RAZR – like its svelte 8.4mm body, invisible splash-guard coasting, and Kevlar strong backing. Beyond that, its specs sheet is able to impress thanks to its 4.3” qHD ColorBoost display, dual-core 1.2GHz processor, 8-megapixel rear camera, and 1080p video capture. On the software side, customers will be pleased to know it’s running Android 4.0 Ice cream Sandwich out of the box – with Motorola’s SMARTACTIONS functionality to extend its performance and battery life.",
        "phonearenaRating": "82",
        "userRating": "8",
        "announceDate": "Aug  1, 2012",
        "status": "Released",
        "releaseDate": "Aug  1, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37470-xlarge/Motorola-ELECTRIFY-2.jpg",
        "weight": "4.59 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola GLEAM+",
        "description": "Motorola GLEAM+ is a basic but yet stylish looking feature phone coming with a fancy LED matrix display that provides expressive notifications and alerts. Other features include a 2.8” WQVGA main display, 2MP camera, FM Radio, music player and microSD card slot for up to 16GB of additional memory.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Feb  9, 2012",
        "status": "Released",
        "releaseDate": "Apr  4, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/34938-large/Motorola-GLEAM.jpg",
        "weight": "",
        "size": "2.8 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto G",
        "description": "Looking at its specs sheet, we're surprised to see how much bang the Moto G can deliver for its money. First and foremost, our eyes are treated to a 4.5-inch \"edge-to-edge\" LCD display with a resolution of 720 by 1280 pixels. This gives us a figure of around 329ppi, which nothing short of great given the phone's cost. A layer of Gorilla Glass 3 protects the screen against light scratches. Then there's the processor ticking inside of the Moto G – a 1.2GHz, quad-core Snapdragon 400 silicon, which is no slouch by any means. 1GB of RAM is available on the device.",
        "phonearenaRating": "9",
        "userRating": "99",
        "announceDate": "Nov 13, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/43971-xlarge/Motorola-Moto-G.jpg",
        "weight": "5.04 oz",
        "size": "4.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID Ultra",
        "description": "The Motorola Droid Ultra comes with a 5-inch HD display. The device is both thinner and more durable than earlier devices thanks to a new unibody kevlar construction. Thickness comes at the slim 7.18mm making this the thinnest 4G LTE phone out there. \n\nA brand new dual-core X8 Mobile Computing system is powering the device allowing exciting new features like ‘Touchless control’ that has your phone listening to you at all times, something we saw on the Moto X leaks. There's also the 'active display' technology that only lights up a part of the screen to conserve battery. Technically, a dual-core processor is what's under the hood, don't get fooled by the '8-core' talk in the event.\n\nThe Droid Ultra features an f/2.4 10-megapixel camera and chances are this is the same unit we'll see on the Motorola Moto X.",
        "phonearenaRating": "87",
        "userRating": "8.79.3",
        "announceDate": "Jul 23, 2013",
        "status": "Released",
        "releaseDate": "Aug 20, 2013",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42065-xlarge/Motorola-DROID-Ultra.jpg",
        "weight": "4.83 oz",
        "size": "5.0 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID RAZR M",
        "description": "Motorola DROID RAZR M is the DROID RAZR HD's little brother. A pretty compact Android smartphone with a spacious qHD screen, beefy battery, and premium design. Then here is what you need to know about the Motorola DROID RAZR M: first of all, it comes with an edge-to-edge, almost bezel-less 4.3-inch display with qHD resolutin (540 by 960 pixels). The panel is built using Super AMOLED Advanced technology, much like what we had on the very first DROID RAZR. Processing power is delivered by a dual-core processor clocked at 1.5GHz and backed up by 1GB of RAM - a hardware combo that is identical to what makes the DROID RAZR HD tick. There is an 8-megapixel autofocus camera with LED flash on its back, and a VGA cam up front for video chats.",
        "phonearenaRating": "85",
        "userRating": "8.59.1",
        "announceDate": "Sep  5, 2012",
        "status": "Released",
        "releaseDate": "Sep 10, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37950-xlarge/Motorola-DROID-RAZR-M.jpg",
        "weight": "4.44 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola i418",
        "description": "The Motorola i418 is a slim iDEN basic phone. It offers camera, Bluetooth and a 2.2'' color screen, and also Micro GPS and microSD Memory Card Slot.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Dec  6, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39342-large/Motorola-i418.jpg",
        "weight": "Dust, Shock, Vibration, Temperature, Humidity resistant\n",
        "size": "2.2 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola i867",
        "description": "Motorola i867 is a rugged iDEN smartphone running Android 2.1 with Push to Talk capabilities. It features a 3.1\" TFT touch screen, 3MP camera, Wi-Fi, GPS, and microSDHC card slot.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Feb 19, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/35015-large/Motorola-i867.jpg",
        "weight": "4.55 oz",
        "size": "3.1 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID RAZR MAXX HD",
        "description": "Just like last year, Motorola is making a souped-up version of its RAZR HD, the RAZR MAXX HD. This year it has the HD after its name, hinting that Moto is finally joining the high-res screen party, but will upgrade where it matters again - the battery. The Motorola DROID RAZR MAXX HD will sport the same 4.7\" Super AMOLED HD screen as its non-Maxx version (what, Samsung is lending those to others now?), and dual-core Snapdragon S4, but will sport a huge 3, 300mAh battery, just like last year. This will allow it the impressive 13 hours of video playback, 21 hours of talk time, 10 hours of streaming video and 27 hours of streaming music over Verizon's LTE network.",
        "phonearenaRating": "87",
        "userRating": "8.79.7",
        "announceDate": "Sep  5, 2012",
        "status": "Released",
        "releaseDate": "Oct 18, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37947-xlarge/Motorola-DROID-RAZR-MAXX-HD.jpg",
        "weight": "5.54 oz",
        "size": "4.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola PHOTON Q 4G LTE",
        "description": "Motorola PHOTON Q 4G LTE is a side-sliding global roaming Android smartphone with QWERTY keyboard and LTE support. Other features include a 4.3\" display, 8MP camera, NFC and microSD memory slot.",
        "phonearenaRating": "7",
        "userRating": "77.3",
        "announceDate": "Jul 26, 2012",
        "status": "Released",
        "releaseDate": "Aug 19, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37353-xlarge/Motorola-PHOTON-Q-4G-LTE.jpg",
        "weight": "6.00 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto X (2014)",
        "description": "With the new Moto X we are getting a 5.2-inch AMOLED display running at 1080p, a customized Snapdragon 801 clocked at 2.5GHz, 2GB of RAM, a 13-megapixel camera, and a 2300mAh battery. The device measures 72.4 x 140.8mm (~2.85 x 5.54-inches) and the width ranges from 3.8 mm (0.15-inches) at the edge to 9.9mm (0.39-inches) at in the middle, and it will weigh 144 g (5.08oz). Sadly, the back logo is not a button, although it does look like one. But, the edge-to-edge design means that Motorola has been able to fit a slightly larger display in the same device width as the Samsung Galaxy S5.",
        "phonearenaRating": "88",
        "userRating": "8.89.4",
        "announceDate": "Sep  4, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49882-large/Motorola-Moto-X-2014.jpg",
        "weight": "5.08 oz",
        "size": "5.2 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR MAXX",
        "description": "Motorola RAZR MAXX is the GSM version of the aforementioned DROID RAZR MAXX. It drops the LTE radio in favor of an HSPA+ one. Other than that, the two devices are pretty much identical. The Android powered Motorola RAZR MAXX packs a 4.3-inch Super AMOLED Advanced display with qHD resolution. Inside it ticks a 1.2GHz dual-core processor accompanied by a gig of RAM. Turn the smartphone around and you will see its 8-megapixel auto-focus camera, but what will also catch your eye is the KEVLAR-made back cover. Surprisingly, the unit itself is only 9 millimeters thick despite having a 3,300mAh battery inside of it. And that amount of juice should be enough to provide the impressive 17 hours of talk time.",
        "phonearenaRating": "85",
        "userRating": "8.59.2",
        "announceDate": "Apr  3, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/35700-xlarge/Motorola-RAZR-MAXX.jpg",
        "weight": "5.11 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto G LTE (2015)",
        "description": "Although almost similar to its 3G-only counterpart, the new Moto G LTE (2015) boasts a few pretty interesting hardware differences in its specs sheet. The most notable one is, naturally, the on-board LTE connectivity. The second noteworthy specs sheet difference is the bigger battery - the LTE-enabled Moto G (2015) comes with a 2,390mAh battery (as a refresher, the 3G-only version has a \"merely\" 2,070mAh one). The larger battery at the back has not resulted in an increased waistline, mind you - the phone is still 11mm thick, but it's slightly heavier (155gr vs 149gr). Unlike the 3G-only Moto G (2014), the LTE-compliant one comes in a dual-SIM version only; it's also only available with 16GB of native storage. In conclusion, the device comes with Android 5.0 Lollipop out of the box.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Feb  2, 2015",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/51529-large/Motorola-Moto-G-LTE-2015.jpg",
        "weight": "5.47 oz",
        "size": "5.0 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto E",
        "description": "The Moto E continues on the design legacy of the Moto X and Moto G, with a similar slightly chubby, curvy form with a dimple on the back. The handset comes with a 4.3-inch display with a resolution of 540 x 960 pixels (qHD). This might sound low on paper, but on this small screen, it works out to the very sharp pixel density of 256ppi. Best of all, the Moto E runs on the latest Android 4.4 KitKat. The little new Moto features a Snapdragon 200 system chip with 1.2GHz dual-core Cortex A7-based processor and an Adreno 302 GPU. There’s 1GB of RAM, and a scarce 4GB of internal storage (only 2.2GB available to end users!) that you can, luckily, expand via microSD cards. It’s also got a 5-megapixel camera (no flash in sight) capable of recording videos with 480 x 854-pixel resolution at 30 frames per second.",
        "phonearenaRating": "9",
        "userRating": "99.5",
        "announceDate": "May 13, 2014",
        "status": "Released",
        "releaseDate": "May 13, 2014",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/47057-xlarge/Motorola-Moto-E.jpg",
        "weight": "5.01 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR V",
        "description": "The Motorola RAZR V is a thin Kevlar smarthone running on Android 4.0. It offers a 4.3'' display along with a 1.2GHz dual-core processor, 1 GB RAM, Internal ROM 4 GB, expandable by up to 32 GB with microSD card, and all the perks of its smart platform.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Mar  1, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39866-large/Motorola-RAZR-V.jpg",
        "weight": "4.59 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola ATRIX HD",
        "description": "Motorola ATRIX HD has a DROID RAZR style body with the now familiar Kevlar back. The 4.5 inch HD screen offers ColorBoost for vibrant colors and sharper images. It has 720 x 1280 pixels resolution and comes with Gorilla Glass. The nanocoated insides help prevent the Motorola ATRIX HD from a death by water. There is a dual-core 1.5GHz processor under the hood, 1 GB of RAM and 8GB of internal storage on board. An 8MP camera is on back, not the 13MP shooter once rumored, and there is a 1.3MP front-facing shooter. Android 4.0 is installed out of the box and it would appear that there are no physical Android navigation buttons. The battery is 1780 mAh. ATRIX HD is a quad-band GSM and quad-band HSPA global phone with support for AT&T's 4G LTE network. For those who keep track, the device is Motorola's model number MB886.",
        "phonearenaRating": "8",
        "userRating": "88.9",
        "announceDate": "Jul 10, 2012",
        "status": "Released",
        "releaseDate": "Jul 15, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37151-xlarge/Motorola-ATRIX-HD.jpg",
        "weight": "4.94 oz",
        "size": "4.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola XT928",
        "description": "The Motorola XT928 is China's version of the the Motorola RAZRs. With a 4.5'' 720x1280 px display, dual-core processor at 1.2GHz, 16GB internal storage, and 1GB RAM it is a powerhouse. It comes flaunting Bluetooth 4, Gorilla Glass, 13 MP shooter with dual flash, and all the standard Android features.",
        "phonearenaRating": "91",
        "userRating": "9",
        "announceDate": "Feb 23, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/35081-xlarge/Motorola-XT928.jpg",
        "weight": "5.26 oz",
        "size": "4.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola Moto G (2014)",
        "description": "While most of the buzz has been for its brother the new Moto X, there is officially a new Moto G as well. Of course, there isn't exactly all that much that is new about the device, as it shares quite a bit in common with last year's Moto G. The major difference this year is in the design of the device, while the internals are only a modest update overall compared to last year's Moto G. On the outside, the changes can be summed up in two points: the display is now 5-inches rather than 4.5, and there are stereo front speakers. That's about it. On the inside, the cameras have gotten modest updates (8-megapixels in the rear and 2-megapixels in the front compared to 5MP and 1.3MP), and there is now a microSD card slot. Otherwise, the device has the same Snapdragon 400, 1GB of RAM, swappable shells, and software offerings.",
        "phonearenaRating": "85",
        "userRating": "8.59.6",
        "announceDate": "Sep  5, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/48890-xlarge/Motorola-Moto-G-2014.jpg",
        "weight": "5.26 oz",
        "size": "5.0 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID Mini",
        "description": "Motorola DROID Mini aims to be a compact Android smartphone that makes no compromise with regards to speed and capability, similarly to what HTC's planning to do with its One mini. The DROID Mini is said to feature all the power of the DROID Ultra, but in a smaller package with a screen of 4.3 inches and a resolution of 720x1280 pixels.",
        "phonearenaRating": "85",
        "userRating": "8.59.7",
        "announceDate": "Jul 23, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/42073-xlarge/Motorola-DROID-Mini.jpg",
        "weight": "4.59 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola MOTOGO!",
        "description": "Motorola MOTOGO! EX430 is a basic phone with QWERTY keyboard featuring a 2.2\" display, 2MP camera and Wi-Fi.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Sep 11, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37982-xlarge/Motorola-MOTOGO.jpg",
        "weight": "",
        "size": "2.2 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DEFY PRO",
        "description": "Thanks to the physical QWERTY keyboard oriented in portrait mode, the Motorola DEFY PRO has a strong resemblance to a BlackBerry model, but adds IP67 certification which means it is resistant to spills and dust. The Motorola DEFY PRO offers a 2.7 inch touchscreen made from Gorilla Glass and is built to take all the abuse that someone with an active lifestyle heaps upon his smartphone. Speaking of active lifestyles, the Motorola DEFY PRO has a special dashboard that helps you track specific outdoor activities such as camping, hiking and a daily workout. There is both a 5MP rear-facing camera and a VGA shooter on front for self-portraits and video chat. Android 2.3 is installed.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Jul 17, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37206-xlarge/Motorola-DEFY-PRO.jpg",
        "weight": "4.06 oz",
        "size": "2.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR D1",
        "description": "The Motorola RAZR D1 is an Android 4.1 phone. It comes with a 3.5'' display, single core CPU at 1 GHz, 4 GB internal memory, microSD card slot for up to 32 GB additional memory, and the standard array of connectivity switches of the mobile OS.",
        "phonearenaRating": "91",
        "userRating": "9",
        "announceDate": "Mar 14, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39890-xlarge/Motorola-RAZR-D1.jpg",
        "weight": "3.88 oz",
        "size": "3.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola MOTOSMART",
        "description": "The Motorola MOTOSMART is an entry-level Android 2.3 Gingerbread trotting smartphone. It features a 3.5” HVGA (320 x 480) display, 3-megapixel camera, HSPA, Bluetooth, FM radio, Wi-Fi, 1,400 mAh battery, 165MB of internal storage, microSD card slot, and the MOTOSWITCH 2.0 UI running on top of Gingerbread.",
        "phonearenaRating": "91",
        "userRating": "9",
        "announceDate": "Jun  7, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/36642-xlarge/Motorola-MOTOSMART.jpg",
        "weight": "4.06 oz",
        "size": "3.5 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR D3",
        "description": "The Motorola RAZR D3 is a mid-range smartphone coming with Android 4.1. On the hardware side the device is packing a 4\" display, dual-core CPU at 1.2 GHz, 1GB RAM, 4GB internal memory, microSD card slot, and all the perks of the Green robot.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Mar 14, 2013",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39895-xlarge/Motorola-RAZR-D3.jpg",
        "weight": "4.23 oz",
        "size": "4.0 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR M",
        "description": "Motorola RAZR M is the RAZR HD's little brother. A pretty compact Android smartphone with a spacious qHD screen, beefy battery, and premium design. Then here is what you need to know about the Motorola RAZR M: first of all, it comes with an edge-to-edge, almost bezel-less 4.3-inch display with qHD resolutin (540 by 960 pixels). The panel is built using Super AMOLED Advanced technology, much like what we had on the very first RAZR. Processing power is delivered by a dual-core processor clocked at 1.5GHz and backed up by 1GB of RAM - a hardware combo that is identical to what makes the RAZR HD tick. There is an 8-megapixel autofocus camera with LED flash on its back, and a VGA cam up front for video chats.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Sep  5, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37954-xlarge/Motorola-RAZR-M.jpg",
        "weight": "4.44 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR i",
        "description": "The Motorola RAZR i became the first phone to clear the whopping 2GHz barrier, and it is powered by a mobile Intel Atom processor manufactured with a 32nm technology. Its 2, 000mAh battery allows all-day smartphoning, just like with the ARM-based processors on other Androids, and a 4.3\" edge-to-edge Super AMOLED display plus a snappy 8MP camera complete the package.",
        "phonearenaRating": "8",
        "userRating": "89",
        "announceDate": "Sep 18, 2012",
        "status": "Released",
        "releaseDate": "Oct  2, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37998-xlarge/Motorola-RAZR-i.jpg",
        "weight": "4.44 oz",
        "size": "4.3 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola RAZR HD",
        "description": "RAZR HD is Motorola's flagship with a huge 4.7-inch 720p Super AMOLED screen with no physical buttons, and the Qualcomm Snapdragon S4 chip with the processor clocked at 1.5GHz. The Motorola RAZR HD runs on Android 4.0.4 Ice Cream Sandwich, but Motorola has promised that they will update the phone to Jelly Bean by the end of the year. The RAZR HD will run on blazing-fast 4G LTE networks and come with Chrome pre-loaded. The handset will also will feature a pretty capable 2,530mAh battery, a capacity surpassing the RAZR by 40%.",
        "phonearenaRating": "885",
        "userRating": "8.8",
        "announceDate": "Sep  5, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37956-xlarge/Motorola-RAZR-HD.jpg",
        "weight": "5.15 oz",
        "size": "4.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID Turbo",
        "description": "Packing arguably one of the best hardware combinations available at the moment, the natural habitat of the Motorola DROID Turbo is somewhere near the very top of Mount Android, thanks to the 5.2-inch Quad HD display, the power-laden 2.7GHz Snapdragon 805, the 3GB of LPDDR3 RAM, the 21MP rear snapper capable of shooting 4K video clips, and the humongous, \"two-day\" 3,900mAh battery inside.",
        "phonearenaRating": "92",
        "userRating": "9.29.5",
        "announceDate": "Oct 28, 2014",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/49888-large/Motorola-DROID-Turbo.jpg",
        "weight": "6.21 oz",
        "size": "5.2 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola DROID RAZR HD",
        "description": "Droid RAZR HD is Motorola's flagship with a huge 4.7-inch 720p Super AMOLED screen with no physical buttons, and the Qualcomm Snapdragon S4 chip with the processor clocked at 1.5GHz. The Motorola Droid RAZR HD runs on Android 4.0.4 Ice Cream Sandwich, but Motorola has promised it’d pay you back $100 if it doesn’t manage to update the phone to Jelly Bean by the end of the year. The Droid RAZR HD will of course run on Verizon's blazing-fast 4G LTE network and come with Chrome pre-loaded. The handset will also will feature a pretty capable 2,530mAh battery, a capacity surpassing the Droid RAZR by 40%.",
        "phonearenaRating": "85",
        "userRating": "8.59.5",
        "announceDate": "Sep  5, 2012",
        "status": "Released",
        "releaseDate": "Oct 18, 2012",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/37943-xlarge/Motorola-DROID-RAZR-HD.jpg",
        "weight": "5.15 oz",
        "size": "4.7 inches"
    },
    {
        "symbol": "MSI",
        "company": "Motorola",
        "name": "Motorola i485",
        "description": "The Motorola i485 is a basic device with full QWERTY keyboard and 2.2'' display. It also offers B;uettoh, 2MP camera, FM radio and PTT.",
        "phonearenaRating": "",
        "userRating": "",
        "announceDate": "Sep 20, 2012",
        "status": "Released",
        "releaseDate": "",
        "imageUrl": "//i-cdn.phonearena.com/images/phones/39714-large/Motorola-i485.jpg",
        "weight": "Shock, Vibration, Temperature resistant\n",
        "size": "2.2 inches"
    }
]